megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
/**
 * @author  Andrey Zaostrovnykh
 * @email   megalloid@mail.ru
 * @link    http://smarthouseautomatics.ru/stm32/stm32f0xx/rcc/
 * @version v0.1
 * @ide     STM32CubeIDE
 * @brief   Библиотека RCC для STM32F0xx
 */


#ifndef MY_STM32F0xx_RCC_H
	#define MY_STM32F0xx_RCC_H 100

	/* C++ detection */
	#ifdef __cplusplus
		extern "C" {
	#endif

	/**
	 * @addtogroup MY_STM32F0xx_Libraries
	 * @{
	 */
		/**
		 * @defgroup MY_HAL_RCC
		 * @brief    Библиотека RCC для STM32F0xx
		 * @{
		 *
		 * RCC библиотека обеспечивает инициализацию тактирования.
		 * Функция @ref MY_RCC_InitSystem должна быть вызвана в начале @ref функции main.
		 *
		 *
		==============================================================================
							##### Особенности RCC #####
		==============================================================================

		После старта устройства для тактирования используется внутернний Internal High Speed осциллятор
		(HSI 8MHz) с Flash 0 wait state, включенным буфером предвыборки Flash prefetch buffer,
		и вся периферия	кроме внутренней SRAM, Flash и JTAG.

		(+) На высокоскоростных (AHB) и низкоскоростных (APB) шинах нет предделителя;
			все периферийные устройства, подключенные к этим шинам, работают на скорости HSI.

		(+) Тактирование отключено для всей периферии кроме SRAM и FLASH.

		(+) Все порты GPIO установлены в input floating режим, исключая выводы JTAG которые используются для отладки.
			После запуска устройства, в приложении необходимо:

		(+) Настроить источник тактирования, который будет использоваться в качестве системного
			(если нужна более высокая частота / производительность)

		(+) Настроить частоту тактирования System clock и настройки Flash

		(+) Настроить предделители шин AHB и APB

		(+) Включить тактирование для используемой периферии

		(+) Настроить источники тактирования для периферии которая не тактируется
			с системной шины System clock (RTC, ADC, I2C, USART, TIM, USB FS, etc..)


		==============================================================================
							##### Ограничения RCC #####
		==============================================================================

		Должна быть принята во внимание задержка между включением тактирования периферии и
		включением самой периферии и рекомендуется делать проверку установки битов чтением/записью из/в регистры.

		(+) Эта задержка зависит от расположения периферийного блока.
			(++) Для AHB и APB периферии, 1 чтение необходимо как минимум
			(++) Для задержки используется установка битов с помощью функции MY_UTILS_SetBitWithRead()

		Workarounds:
		(#) Для AHB и APB периферии, используется MY_UTILS_SetBitWithRead() для фиктивной задержки при включении тактирования


		===============================================================================
							##### Функции инициализации и деинициализации #####
		===============================================================================

		В данном разделе описано как обеспечить настройку внешних или внутренникх осцилляторов
		(HSE, HSI, HSI14, HSI48, LSE, LSI, PLL, CSS и MCO) и системные шины тактирования (SYSCLK, AHB и APB1)
		которые возможно использовать в STM32F0xx-семействе контроллеров

		Настройка внешнего/внутреннего источника тактирования и PLL

		(#) HSI (high-speed internal), устанавливаемая при производстве 8 MHz RC-цепь используемая напрямую
			или через PLL в качестве источника системного тактирования.
			HSI может использоваться также в качестве тактирования USART и I2C.

		(#) HSI14 (high-speed internal), устанавливаемая при производстве 14 MHz RC-цепь
			для прямого тактирования ADC.

		(#) LSI (low-speed internal), энергоэффективная ~40 KHz RC-цепь используемая
			в качестве источника тактирования для IWDG и/или RTC

		(#) HSE (high-speed external), внешний кварцевый осциллятор номиналом от 4 до 32 MHz
			может использоваться напрямую или через PLL в качестве источника системного тактирования.
			Может так же использоваться в качестве источника тактирования для RTC.

		(#) LSE (low-speed external), осциллятор 32 KHz который используется для тактирования RTC.

		(#) PLL (может тактироваться от HSI, HSI48 или HSE), так же содержит несколько выходных тактовых сигналов:

			(++) Первый выход используется для генерации высокоскоростного тактового сигнала для системного тактирования (до 48 MHz)
			(++) Второй выход используется для генерации тактового сигнала для USB FS (48 MHz)
			(++) Третий выход может использоваться для генерации тактового сигнала для TIM, I2C и USART (до 48 MHz)

		(#) CSS (Clock security system), включается единоразово через вызов макроса MY_RCC_CSS_ENABLE()
			и если HSE тактирование нарушится (если HSE использовано напрямую или через PLL как источник системного тактирования),
			то системное тактировани автоматически переключится на HSI и сгенерирует прерывание.
			Данное прерывание генерируется в качестве немаскированного (Cortex-M0 Non-Maskable Interrupt exception vector).

		(#) MCO (microcontroller clock output), используется для вывода тактовой частоты
			с SYSCLK, HSI, HSE, LSI, LSE или PLL (деленый на 2) на GPIO-ножку (используется PA8).


		Настройка системного тактирования и шин AHB и APB

		(#) Может использоваться несколько источников тактироваиня дл яSystem clock (SYSCLK): HSI, HSE и PLL.
			Тактирование шины AHB (HCLK) обеспечивается с системной шины через настраиваемый
			предделитель и используется для тактирования CPU, памяти и периферии которая находится на шине AHB (DMA, GPIO и т.д.).
			Тактовый сигнал для APB1 (PCLK1) используется из AHB шины через конфигурируемый предделитель
			и используется для тактирования периферии расположенной на этой шине.
			Вы можеет использовать функцию @ref MY_RCC_GetSysClockFreq() для получения текущего значения частоты.

		(#) Все тактирование периферии обеспечивается с системной шины(SYSCLK) за исключением:

			(++) Программирование/очистка FLASH памяти тактируется всегда с HSI 8MHz.
			(++) Тактирование USB 48 MHz всегда обеспечивается через PLL VCO.
			(++) Тактирование USART может быть обеспечено в т.ч. с HSI 8MHz, либо с LSI или LSE.
			(++) Тактирование I2C может обеспечиваться так же через HSI 8MHz.
			(++) Тактирование ADC может быть обеспечено через PLL.
			(++) Тактирование RTC может быть обеспечено с LSE, LSI или 1 MHz HSE_RTC
				(частота с HSE делится на программно устанавливаемый предделитель). Частота системного тактирования(SYSCLK)
				должна быть больше или равной частоте тактирования RTC.
			(++) Тактирование IWDG всегда обеспечивается через LSI.

