megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
		(#) Для серии STM32F0xx максимальная частотат SYSCLK, HCLK и PCLK1 равна 48 MHz,
			В зависимости от частоты SYSCLK, задержка выборки при чтении (flash latency) должна быть
			установлены в соответствии с системной частотой.

		(#) После сброса для тактирования системной шины всегда используется HSI (8 MHz) с 0 WS и отключеной предвыборкой (prefetch).

			Таблица установки задержки в соответствии с частотой:

			+-----------------------------------------------+
			| Задержка      | SYSCLK clock frequency (MHz)  |
			|---------------|-------------------------------|
			|0WS(1CPU cycle)|       0 < SYSCLK <= 24        |
			|---------------|-------------------------------|
			|1WS(2CPU cycle)|      24 < SYSCLK <= 48        |
			+-----------------------------------------------+

		===============================================================================
					##### Функции Extended Clock Recovery System Control #####
		===============================================================================

		Для устройств с поддержкой системы Clock Recovery System (CRS), библиотека RCC может быть использована для:

		(#) В конфигурации системного тактирования, если нужно задействовать HSI48

		(#) Включение тактирования CRS в инициализации встроенной периферии которая использует функции CRS

		(#) Вызов функций работы с CRS, такие как:

			(##) Подготовка синхронизации важной для калибровки HSI48:

				(+++) Значения по умолчанию могут быть установлены для частоты Error Measurement (лимит перезагрузки и ошибки)
					  и также для сглаживания частоты осцилляции HSI48.

				(+++) Макрос MY_RCC_CRS_RELOADVALUE_CALCULATE может быть так же использован для вычисления
					  значения перезагрузки с целевыми значениями и частотами синхронизации

			(##) Вызов функции MY_RCC_CRSConfig которая:

				(+++) Сброс регистров CRS к значениям по умолчанию

				(+++) Настройка регистров CRS с настройками синхронизации

				(+++) Включение автоматической калибровки частоты и подсчёта количества данных ошибок

				Примечание: Когда используется USB LPM (Link Power Management) и устройство находится в Sleep mode,
				периодический пакет USB SOF не генерируется хостом. Таким образом, сигнал синхронизации не будет подаватьсяв CRS
				для калибровки HSI48 на ходу. Чтобы гарантировать необходимую точность синхронизации после выхода из спящего режима,
				в качестве сигнала синхронизации следует использовать LSE или опорный источник тактирования на GPIO.

			(##) Предусмотрена функция опроса для ожидания полной синхронизации:

				(+++) Вызовом функции MY_RCC_CRSWaitSynchronization()

				(+++) В соответствии со статусом CRS, пользователь может повторно провести калибровку или продолжить
					  выполнение если синхронизация в норме.

		(#) Пользователь может получить информацию о синхронизации вызвав функцию MY_RCC_CRSGetSynchronizationInfo()

		(#) Что касается статуса синхронизации и информации о синхронизации, пользователь может попробовать обновленную
			калибровку изменив конфигурацию синхронизации и повторно вызвав MY_RCC_CRSConfig.

			Примечание: Когда событие синхронизации обнаружено во время фазы нисходящего счета (до достижения нулевого значения),
			это означает, что фактическая частота ниже целевой (и поэтому значение обрезки должно быть увеличено),
			в то время как когда оно обнаружено во время фазы восходящего счета, это означает, что фактическая частота
			выше (и что значение подстройки должно быть уменьшено).

		(#) В режиме прерываний, пользователь может использовать макрос (MY_RCC_CRS_XXX_IT).
			Прерывание пройдет через CRS Handler (RCC_IRQn/RCC_IRQHandler).
			Осуществляется это следующим образом:

			(++) Вызов функции MY_RCC_CRSConfig()
			(++) Включение RCC_IRQn (через NVIC функции)
			(++) Включение CRS прерывания (@ref MY_RCC_CRS_ENABLE_IT)
			(++) Реализация усправления статусом CRS по следующим вызовам callback-функций вызываемых из MY_RCC_CRS_IRQHandler():

				(+++) MY_RCC_CRS_SyncOkCallback()
				(+++) MY_RCC_CRS_SyncWarnCallback()
				(+++) MY_RCC_CRS_ExpectedSyncCallback()
				(+++) MY_RCC_CRS_ErrorCallback()

		(#) Чтобы вручную вызвать SYNC EVENT, пользователь может использовать функцию MY_RCC_CRSSoftwareSynchronizationGenerate().
			Эта функция может быть вызвана перед вызовом MY_RCC_CRSConfig (например в обработчике прерывания от Systick)
		*/

		#include "main.h"
		#include "my_stm32f0xx.h"
		#include "my_stm32f0xx_cortex.h"
		#include "my_stm32f0xx_utils.h"
		#include "my_stm32f0xx_gpio.h"


		/**
		 * @defgroup MY_Settings
		 * @brief    Библиотечные настройки
		 * Данные настройки используются по умолчанию если они не переобъявлены в настройках проекта или в файле main.h
		 * @{
		 */
			/**
			 * @brief Укажите значение внешнего высокоскоростного кварцевого осциллятора (HSE) используемого в приложении.
			 *        Это значение используется так же для рассчета системной частоты в функциях библиотеки.
			 *        (когда HSE используется в качестве источника системного тактирования, напрямую или через PLL).
			 */
			#if !defined (HSE_VALUE)
				#define   HSE_VALUE            							8000000U  	/*!< Значение в герцах */
			#endif


			/**
			 * @brief Значение таймаута старта HSE
			 */
			#if !defined (HSE_STARTUP_TIMEOUT)
				#define   HSE_STARTUP_TIMEOUT  							100U      	/*!< Время старта HSE в мс. */
			#endif


			/**
			 * @brief Включение или отключение HSE bypass
			 */
			#ifndef 	RCC_HSE_BYPASS_STATE
				#define RCC_HSE_BYPASS_STATE							0U
			#endif


			/**
			 * @brief Укажите значение внутреннего высокоскоростного осциллятора (HSI) используемого в приложении.
			 *        Это значение используется так же для рассчета системной частоты в функциях библиотеки.
			 *        (когда HSE используется в качестве источника системного тактирования, напрямую или через PLL).
			 */
			#if !defined (HSI_VALUE)
				#define   HSI_VALUE            							8000000U  	/*!< Значение в герцах */
			#endif


			/**
			 * @brief Значение таймаута старта HSI
			 */
			#if !defined (HSI_STARTUP_TIMEOUT)
				#define   HSI_STARTUP_TIMEOUT  							5000U     	/*!< Время старта HSI в мс. */
			#endif


			/**
			 * @brief Частота внутреннего высокоскоростного осциллятора используемого для ADC (HSI14)
			 */
			#if !defined (HSI14_VALUE)
				#define   HSI14_VALUE          							14000000U 	/*!< Значение в герцах. Реальное значение может меняться в зависимости от питающего напряжения и температуры */
			#endif


			/**
			 * @brief Значение калибровки для ADC (HSI14)
			 */
			#if !defined (RCC_HSI14CALIBRATION_VALUE)
				#define   RCC_HSI14CALIBRATION_VALUE        			0U 		/*!< Значение должно быть в диапазоне от 0 до 0x1F */
			#endif


			/**
			 * @brief Частота внутреннего высокоскоростного осциллятора используемого для USB (HSI48)
			 */
			#if !defined (HSI48_VALUE)
				#define   HSI48_VALUE          							48000000U 	/*!< Значение в герцах. Реальное значение может меняться в зависимости от питающего напряжения и температуры */
			#endif


			/**
			 * @brief Частота внутреннего низкоскоростного осциллятора (LSI)
			 */
			#if !defined (LSI_VALUE)
				#define   LSI_VALUE            							40000U   		/*!< Значение в герцах. Реальное значение может меняться в зависимости от питающего напряжения и температуры */
			#endif


			/**
			 * @brief Частота внешнего низкоскоростного осциллятора (LSE)
			 */
			#if !defined (LSE_VALUE)
				#define   LSE_VALUE            							32768U    	/*!< Значение в герцах. */
			#endif


			/**
			 * @brief Значение таймаута старта LSE
			 */
			#if !defined (LSE_STARTUP_TIMEOUT)
				#define   LSE_STARTUP_TIMEOUT  							5000U     	/*!< Время для старта LSE в мс. */
			#endif


			/**
			 * @brief Включение или отключение LSE bypass
			 */
			#ifndef 		RCC_LSE_BYPASS_STATE
				#define RCC_LSE_BYPASS_STATE								0U
			#endif


			/**
			 * @} MY_Settings
			 */

			/**
			 * @defgroup MY_RCC_Defines
			 * @brief    RCC библиотечные константы
			 * @{
			 */
				/**
				 * @brief Регистры и нумерации битов в RCC
				 * @{
				 */
					/* Смещение регистра в карте памяти относительного базового адреса */
					#define RCC_OFFSET                						(RCC_BASE - PERIPH_BASE)

