megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
					/* Смещения регистров отдельных регистров модуля RCC */
					#define RCC_CR_OFFSET             						0x00
					#define RCC_CFGR_OFFSET           						0x04
					#define RCC_CIR_OFFSET            						0x08
					#define RCC_BDCR_OFFSET           						0x20
					#define RCC_CSR_OFFSET            						0x24

					/* Прямое объявление адресов регистров RCC */
					#define REG_RCC_CR         								(RCC_BASE + 0x00000000)	/*!< RCC clock control */
					#define REG_RCC_CFGR       								(RCC_BASE + 0x00000004)	/*!< RCC clock configuration */
					#define REG_RCC_CIR        								(RCC_BASE + 0x00000008)	/*!< RCC clock interrupt */
					#define REG_RCC_APB2RSTR   								(RCC_BASE + 0x0000000C)	/*!< RCC APB2 peripheral reset */
					#define REG_RCC_APB1RSTR   								(RCC_BASE + 0x00000010)	/*!< RCC APB1 peripheral reset */
					#define REG_RCC_AHBENR     								(RCC_BASE + 0x00000014)	/*!< RCC AHB peripheral clock */
					#define REG_RCC_APB2ENR    								(RCC_BASE + 0x00000018)	/*!< RCC APB2 peripheral clock enable */
					#define REG_RCC_APB1ENR    								(RCC_BASE + 0x0000001C)	/*!< RCC APB1 peripheral clock enable */
					#define REG_RCC_BDCR       								(RCC_BASE + 0x00000020)	/*!< RCC Backup domain control */
					#define REG_RCC_CSR        								(RCC_BASE + 0x00000024)	/*!< RCC clock control & status */
					#define REG_RCC_AHBRSTR 								(RCC_BASE + 0x00000028)	/*!< RCC AHB peripheral reset */
					#define REG_RCC_CFGR2      								(RCC_BASE + 0x0000002C)	/*!< RCC clock configuration 2 */
					#define REG_RCC_CFGR3      								(RCC_BASE + 0x00000030)	/*!< RCC clock configuration 3 */
					#define REG_RCC_CR2        								(RCC_BASE + 0x00000034)	/*!< RCC clock control 2 */


					/* Байт 2 регистра CR (биты [23:16]) относительно базового адреса RCC */
					#define RCC_CR_BYTE2_ADDRESS      						((uint32_t)(RCC_BASE + RCC_CR_OFFSET + 0x02U))

					/* Байт 1 регистра CIR (биты [15:8]) относительно базового адреса RCC */
					#define RCC_CIR_BYTE1_ADDRESS     						((uint32_t)(RCC_BASE + RCC_CIR_OFFSET + 0x01U))

					/* Байт 2 регистра CIR (биты [23:16]) относительно базового адреса RCC */
					#define RCC_CIR_BYTE2_ADDRESS     						((uint32_t)(RCC_BASE + RCC_CIR_OFFSET + 0x02U))

					/* Константы используемые для объявления флагов */
					#define CR_REG_INDEX              						((uint8_t)1U)
					#define CR2_REG_INDEX             						((uint8_t)2U)
					#define BDCR_REG_INDEX            						((uint8_t)3U)
					#define CSR_REG_INDEX            	 					((uint8_t)4U)

					/* Позиции битов в CFGR регистре */
					#define RCC_CFGR_PLLMUL_BITNUMBER         				18U
					#define RCC_CFGR_HPRE_BITNUMBER           				4U
					#define RCC_CFGR_PPRE_BITNUMBER           				8U

					/* Флаги в CFGR2 регистре */
					#define RCC_CFGR2_PREDIV_BITNUMBER        				0

					/* Флаги в CR регистре */
					#define RCC_CR_HSIRDY_BITNUMBER           				1
					#define RCC_CR_HSERDY_BITNUMBER           				17
					#define RCC_CR_PLLRDY_BITNUMBER           				25

					/* Флаги в CR2 регистре */
					#define RCC_CR2_HSI14RDY_BITNUMBER        				1
					#define RCC_CR2_HSI14TRIM_BITNUMBER         			3
					#define RCC_CR2_HSI48RDY_BITNUMBER       				16

					/* Флаги в BDCR регистре */
					#define RCC_BDCR_LSERDY_BITNUMBER         				1

					/* Флаги в CSR регистре */
					#define RCC_CSR_LSIRDY_BITNUMBER          				1
					#define RCC_CSR_V18PWRRSTF_BITNUMBER      				23
					#define RCC_CSR_RMVF_BITNUMBER            				24
					#define RCC_CSR_OBLRSTF_BITNUMBER         				25
					#define RCC_CSR_PINRSTF_BITNUMBER         				26
					#define RCC_CSR_PORRSTF_BITNUMBER         				27
					#define RCC_CSR_SFTRSTF_BITNUMBER         				28
					#define RCC_CSR_IWDGRSTF_BITNUMBER        				29
					#define RCC_CSR_WWDGRSTF_BITNUMBER        				30
					#define RCC_CSR_LPWRRSTF_BITNUMBER        				31

					/* Флаги в HSITRIM регистре */
					#define RCC_CR_HSITRIM_BITNUMBER          				3
					#define RCC_HSI14TRIM_BITNUMBER           				3

					#define RCC_FLAG_MASK                    				((uint8_t)0x1FU)

					/* Позиции битов CRS в регистрах */
					#define CRS_CFGR_FELIM_BITNUMBER    					16
					#define CRS_CR_TRIM_BITNUMBER       					8
					#define CRS_ISR_FECAP_BITNUMBER     					16

				/**
				 * @}
				 */


				/**
				 * @brief Тип используемого осциллятора
				 * @{
				 */
					#define RCC_OSCILLATORTYPE_NONE            				((uint32_t)0x00000000U)
					#define RCC_OSCILLATORTYPE_HSE             				((uint32_t)0x00000001U)
					#define RCC_OSCILLATORTYPE_HSI             				((uint32_t)0x00000002U)
					#define RCC_OSCILLATORTYPE_LSE             				((uint32_t)0x00000004U)
					#define RCC_OSCILLATORTYPE_LSI             				((uint32_t)0x00000008U)
					#define RCC_OSCILLATORTYPE_HSI14           				((uint32_t)0x00000010U)

					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

						#define RCC_OSCILLATORTYPE_HSI48   					((uint32_t)0x00000020)

					#endif

				/**
				 * @}
				 */


				/**
				 * @brief Источник тактирования SYSCLK
				 * @{
				 */
					#define RCC_SYSCLK_SOURCE_HSE             				RCC_CFGR_SW_HSE
					#define RCC_SYSCLK_SOURCE_HSI             				RCC_CFGR_SW_HSI
					#define RCC_SYSCLK_SOURCE_PLL             				RCC_CFGR_SW_PLL

					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

						#define RCC_SYSCLKSOURCE_HSI48      				RCC_CFGR_SW_HSI48

					#endif

				/**
				 * @}
				 */


				/**
				 * @brief Предделитель для шины AHB (SYSCLK)
				 * @{
				 */
					#define RCC_AHB_DIV1                        		RCC_CFGR_HPRE_DIV1
					#define RCC_AHB_DIV2                        		RCC_CFGR_HPRE_DIV2
					#define RCC_AHB_DIV4                        		RCC_CFGR_HPRE_DIV4
					#define RCC_AHB_DIV8                        		RCC_CFGR_HPRE_DIV8
					#define RCC_AHB_DIV16                      			RCC_CFGR_HPRE_DIV16
					#define RCC_AHB_DIV64                       		RCC_CFGR_HPRE_DIV64
					#define RCC_AHB_DIV128                      		RCC_CFGR_HPRE_DIV128
					#define RCC_AHB_DIV256                      		RCC_CFGR_HPRE_DIV256
					#define RCC_AHB_DIV512                      		RCC_CFGR_HPRE_DIV512

				/**
				 * @}
				 */


				/**
				 * @brief Делитель шины APB1 (HCLK)
				 * @{
				 */
					#define RCC_APB1_DIV1                      			RCC_CFGR_PPRE_DIV1
					#define RCC_APB1_DIV2                       		RCC_CFGR_PPRE_DIV2
					#define RCC_APB1_DIV4                       		RCC_CFGR_PPRE_DIV4
					#define RCC_APB1_DIV8                       		RCC_CFGR_PPRE_DIV8
					#define RCC_APB1_DIV16                      		RCC_CFGR_PPRE_DIV16

				/**
				 * @}
				 */


				/**
				 * @brief Шины системного тактирования
				 * @{
				 */
					#define RCC_CLOCKTYPE_SYSCLK                		((uint32_t)0x00000001U)
					#define RCC_CLOCKTYPE_HCLK                  		((uint32_t)0x00000002U)
					#define RCC_CLOCKTYPE_PCLK1                 		((uint32_t)0x00000004U)

				/**
				 * @}
				 */


				/**
				 * @brief Переферия с отдельными источниками тактирования
				 * @{
				 */
					#if defined(STM32F030x6) || \
						defined(STM32F030x8) || \
						defined(STM32F031x6) || \
						defined(STM32F038xx) || \
						defined(STM32F030xC)

						#define RCC_PERIPHCLK_USART1        			((uint32_t)0x00000001U)
						#define RCC_PERIPHCLK_I2C1          			((uint32_t)0x00000020U)
						#define RCC_PERIPHCLK_RTC           			((uint32_t)0x00010000U)

					#elif defined(STM32F070x6) || \
						  defined(STM32F070xB)

						#define RCC_PERIPHCLK_USART1          			((uint32_t)0x00000001U)
						#define RCC_PERIPHCLK_I2C1            			((uint32_t)0x00000020U)
						#define RCC_PERIPHCLK_RTC             			((uint32_t)0x00010000U)
						#define RCC_PERIPHCLK_USB             			((uint32_t)0x00020000U)

					#elif defined(STM32F042x6) || \
						  defined(STM32F048xx)

						#define RCC_PERIPHCLK_USART1          			((uint32_t)0x00000001U)
						#define RCC_PERIPHCLK_I2C1            			((uint32_t)0x00000020U)
						#define RCC_PERIPHCLK_CEC             			((uint32_t)0x00000400U)
						#define RCC_PERIPHCLK_RTC             			((uint32_t)0x00010000U)
						#define RCC_PERIPHCLK_USB             			((uint32_t)0x00020000U)

