megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
					#elif defined(STM32F051x8) || \
						  defined(STM32F058xx)

						#define RCC_PERIPHCLK_USART1          			((uint32_t)0x00000001U)
						#define RCC_PERIPHCLK_I2C1            			((uint32_t)0x00000020U)
						#define RCC_PERIPHCLK_CEC             			((uint32_t)0x00000400U)
						#define RCC_PERIPHCLK_RTC             			((uint32_t)0x00010000U)

					#elif defined(STM32F071xB)

						#define RCC_PERIPHCLK_USART1          			((uint32_t)0x00000001U)
						#define RCC_PERIPHCLK_USART2          			((uint32_t)0x00000002U)
						#define RCC_PERIPHCLK_I2C1            			((uint32_t)0x00000020U)
						#define RCC_PERIPHCLK_CEC             			((uint32_t)0x00000400U)
						#define RCC_PERIPHCLK_RTC             			((uint32_t)0x00010000U)

					#elif defined(STM32F072xB) || \
						  defined(STM32F078xx)

						#define RCC_PERIPHCLK_USART1          			((uint32_t)0x00000001U)
						#define RCC_PERIPHCLK_USART2          			((uint32_t)0x00000002U)
						#define RCC_PERIPHCLK_I2C1            			((uint32_t)0x00000020U)
						#define RCC_PERIPHCLK_CEC             			((uint32_t)0x00000400U)
						#define RCC_PERIPHCLK_RTC             			((uint32_t)0x00010000U)
						#define RCC_PERIPHCLK_USB             			((uint32_t)0x00020000U)

					#elif defined(STM32F091xC) || \
						  defined(STM32F098xx)

						#define RCC_PERIPHCLK_USART1          			((uint32_t)0x00000001U)
						#define RCC_PERIPHCLK_USART2          			((uint32_t)0x00000002U)
						#define RCC_PERIPHCLK_I2C1            			((uint32_t)0x00000020U)
						#define RCC_PERIPHCLK_CEC             			((uint32_t)0x00000400U)
						#define RCC_PERIPHCLK_RTC             			((uint32_t)0x00010000U)
						#define RCC_PERIPHCLK_USART3          			((uint32_t)0x00040000U)

					#endif

				/**
				 * @}
				 */


				/**
				 * @brief Таймауты RCC
				 * @{
				 */
					#define HSE_TIMEOUT_VALUE                   		((uint32_t)100U)	/*!< Таймаут для старта HSE, в 100 ms */
					#define HSI_TIMEOUT_VALUE                   		((uint8_t)2U)      	/*!< Таймаут для старта HSI, 2 ms (Tick + 1U) */
					#define LSI_TIMEOUT_VALUE                   		((uint8_t)2U)     	/*!< Таймаут для старта LSI, 2 ms (Tick + 1U) */
					#define PLL_TIMEOUT_VALUE                   		((uint8_t)2U)      	/*!< Таймаут для старта PLL, 2 ms (Tick + 1U) */
					#define HSI14_TIMEOUT_VALUE                 		((uint8_t)2U)      	/*!< Таймаут для старта HSI14, 2 ms (Tick + 1U) */

					#define RCC_DBP_TIMEOUT_VALUE      					(100U)       		/*!< Таймаут смены состояние защиты от записи в Disable Backup domain */
					#define RCC_LSE_TIMEOUT_VALUE      					LSE_STARTUP_TIMEOUT	/*!< Таймаут смены статуса LSE */

					#define CLOCKSWITCH_TIMEOUT_VALUE  					(5000U)  			/*!< Таймаут для смены источника тактировани 5 s */

					#if defined(RCC_HSI48_SUPPORT)
						#define HSI48_TIMEOUT_VALUE        				((uint8_t)2U)      	/*!< Таймаут для HSI48,  2 ms (minimum Tick + 1U) */
					#endif

				/**
				 * @}
				 */


				/**
				 * @brief Константы для MCO
				 * @{
				 */
					/* Используемые порт и пин для MCO */
					#define MCO1_GPIO_PORT        						GPIOA
					#define MCO1_PIN              						GPIO_PIN_8

				/**
				 * @}
				 */


				/**
				 * @brief Константы для Clock Recovery System (HSI48)
				 * @{
				 */
					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

						/* RCC CRS Status */
						#define RCC_CRS_NONE      						((uint32_t)0x00000000U)
						#define RCC_CRS_TIMEOUT   						((uint32_t)0x00000001U)
						#define RCC_CRS_SYNCOK    						((uint32_t)0x00000002U)
						#define RCC_CRS_SYNCWARM  						((uint32_t)0x00000004U)
						#define RCC_CRS_SYNCERR   						((uint32_t)0x00000008U)
						#define RCC_CRS_SYNCMISS  						((uint32_t)0x00000010U)
						#define RCC_CRS_TRIMOV    						((uint32_t)0x00000020U)


						/* RCC CRS SynchroSource */
						#define RCC_CRS_SYNC_SOURCE_GPIO       			((uint32_t)0x00000000U) /*!< Synchro Signal soucre GPIO */
						#define RCC_CRS_SYNC_SOURCE_LSE        			CRS_CFGR_SYNCSRC_0      /*!< Synchro Signal source LSE */
						#define RCC_CRS_SYNC_SOURCE_USB        			CRS_CFGR_SYNCSRC_1      /*!< Synchro Signal source USB SOF (default)*/


						/* RCC CRS SynchroDivider */
						#define RCC_CRS_SYNC_DIV1        				((uint32_t)0x00000000U) /*!< Synchro Signal not divided (default) */
						#define RCC_CRS_SYNC_DIV2        				CRS_CFGR_SYNCDIV_0      /*!< Synchro Signal divided by 2 */
						#define RCC_CRS_SYNC_DIV4        				CRS_CFGR_SYNCDIV_1                        /*!< Synchro Signal divided by 4 */
						#define RCC_CRS_SYNC_DIV8        			 	(CRS_CFGR_SYNCDIV_1 | CRS_CFGR_SYNCDIV_0) /*!< Synchro Signal divided by 8 */
						#define RCC_CRS_SYNC_DIV16       				CRS_CFGR_SYNCDIV_2                        /*!< Synchro Signal divided by 16 */
						#define RCC_CRS_SYNC_DIV32       				(CRS_CFGR_SYNCDIV_2 | CRS_CFGR_SYNCDIV_0) /*!< Synchro Signal divided by 32 */
						#define RCC_CRS_SYNC_DIV64       			 	(CRS_CFGR_SYNCDIV_2 | CRS_CFGR_SYNCDIV_1) /*!< Synchro Signal divided by 64 */
						#define RCC_CRS_SYNC_DIV128      				CRS_CFGR_SYNCDIV                          /*!< Synchro Signal divided by 128 */


						/* RCC CRS SynchroPolarity */
						#define RCC_CRS_SYNC_POLARITY_RISING        	((uint32_t)0x00000000U) /*!< Synchro Active on rising edge (default) */
						#define RCC_CRS_SYNC_POLARITY_FALLING       	CRS_CFGR_SYNCPOL      	/*!< Synchro Active on falling edge */


						/* RCC CRS ReloadValueDefault */
						#define RCC_CRS_RELOADVALUE_DEFAULT         	((uint32_t)0x0000BB7FU) /*!< The reset value of the RELOAD field corresponds
																									 to a target frequency of 48 MHz and a synchronization
																																																			 signal frequency of 1 kHz (SOF signal from USB). */

						/* RCC CRS ErrorLimitDefault */
						#define RCC_CRS_ERRORLIMIT_DEFAULT          	((uint32_t)0x00000022U) /*!< Default Frequency error limit */


						/* RCC CRS HSI48CalibrationDefault */
						#define RCC_CRS_HSI48CALIBRATION_DEFAULT    	((uint32_t)0x00000020U) /*!< The default value is 32, which corresponds to the middle of the trimming interval.
																																																			The trimming step is around 67 kHz between two consecutive TRIM steps. A higher TRIM value
																																																			corresponds to a higher output frequency */
						/* RCC CRS FreqErrorDirection*/
						#define RCC_CRS_FREQERRORDIR_UP             	((uint32_t)0x00000000U)   /*!< Upcounting direction, the actual frequency is above the target */
						#define RCC_CRS_FREQERRORDIR_DOWN           	((uint32_t)CRS_ISR_FEDIR) /*!< Downcounting direction, the actual frequency is below the target */

					#endif

				/**
				 * @} CRS
				 */

			/**
			 * @} MY_RCC_Defines
			 */


			/**
			 * @defgroup MY_RCC_Macros
			 * @brief    RCC библиотечные макросы
			 * @{
			 */
				/**
				 * @brief	Быстрые макросы для включения/выключения и проверки тактирования на шине AHB
				 * @note   	После сброса тактирование периферии (используемая в т.ч. для чтения/записи регистров) отключается,
				 *			и перед использованием периферии тактирование должно включаться вручную.
				 * @{
				 */
					#define MY_RCC_AHB_FORCE_RESET()     				(RCC->AHBRSTR = 0xFFFFFFFFU)
					#define MY_RCC_AHB_RELEASE_RESET()   				(RCC->AHBRSTR = 0x00000000U)

					/* GPIOA */
					#define MY_RCC_GPIOA_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_GPIOAEN);
					#define MY_RCC_GPIOA_CLK_DISABLE()  				(RCC->AHBENR &= ~(RCC_AHBENR_GPIOAEN))

					#define MY_RCC_GPIOA_IS_CLK_ENABLED() 				((RCC->AHBENR & (RCC_AHBENR_GPIOAEN)) != RESET)
					#define MY_RCC_GPIOA_IS_CLK_DISABLED()  			((RCC->AHBENR & (RCC_AHBENR_GPIOAEN)) == RESET)

					#define MY_RCC_GPIOA_FORCE_RESET()   				(RCC->AHBRSTR |= (RCC_AHBRSTR_GPIOARST))
					#define MY_RCC_GPIOA_RELEASE_RESET() 				(RCC->AHBRSTR &= ~(RCC_AHBRSTR_GPIOARST))

					/* GPIOB */
					#define MY_RCC_GPIOB_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_GPIOBEN);
					#define MY_RCC_GPIOB_CLK_DISABLE()    			 	(RCC->AHBENR &= ~(RCC_AHBENR_GPIOBEN))

					#define MY_RCC_GPIOB_IS_CLK_ENABLED()     		 	((RCC->AHBENR & (RCC_AHBENR_GPIOBEN)) != RESET)
					#define MY_RCC_GPIOB_IS_CLK_DISABLED()    		 	((RCC->AHBENR & (RCC_AHBENR_GPIOBEN)) == RESET)

