megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
					#define MY_RCC_GPIOB_FORCE_RESET()   				(RCC->AHBRSTR |= (RCC_AHBRSTR_GPIOBRST))
					#define MY_RCC_GPIOB_RELEASE_RESET() 				(RCC->AHBRSTR &= ~(RCC_AHBRSTR_GPIOBRST))

					/* GPIOC */
					#define MY_RCC_GPIOC_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_GPIOCEN);
					#define MY_RCC_GPIOC_CLK_DISABLE()    			 	(RCC->AHBENR &= ~(RCC_AHBENR_GPIOCEN))

					#define MY_RCC_GPIOC_IS_CLK_ENABLED()     		 	((RCC->AHBENR & (RCC_AHBENR_GPIOCEN)) != RESET)
					#define MY_RCC_GPIOC_IS_CLK_DISABLED()    		 	((RCC->AHBENR & (RCC_AHBENR_GPIOCEN)) == RESET)

					#define MY_RCC_GPIOC_FORCE_RESET()   				(RCC->AHBRSTR |= (RCC_AHBRSTR_GPIOCRST))
					#define MY_RCC_GPIOC_RELEASE_RESET() 				(RCC->AHBRSTR &= ~(RCC_AHBRSTR_GPIOCRST))


					#if defined(STM32F030x6) || \
						defined(STM32F030x8) || \
						defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F070xB) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* GPIOD */
						#define MY_RCC_GPIOD_CLK_ENABLE()   			MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_GPIODEN);
						#define MY_RCC_GPIOD_CLK_DISABLE()       		(RCC->AHBENR &= ~(RCC_AHBENR_GPIODEN))

						#define MY_RCC_GPIOD_IS_CLK_ENABLED()      		((RCC->AHBENR & (RCC_AHBENR_GPIODEN)) != RESET)
						#define MY_RCC_GPIOD_IS_CLK_DISABLED()     		((RCC->AHBENR & (RCC_AHBENR_GPIODEN)) == RESET)

						#define MY_RCC_GPIOD_FORCE_RESET()   			(RCC->AHBRSTR |= 	(RCC_AHBRSTR_GPIODRST))
						#define MY_RCC_GPIOD_RELEASE_RESET() 			(RCC->AHBRSTR &= ~(RCC_AHBRSTR_GPIODRST))

					#endif


					#if defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F070xB) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* GPIOE */
						#define MY_RCC_GPIOE_CLK_ENABLE()   			MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_GPIOEEN);
						#define MY_RCC_GPIOE_CLK_DISABLE()        		(RCC->AHBENR &= ~(RCC_AHBENR_GPIOEEN))

						#define MY_RCC_GPIOE_IS_CLK_ENABLED()      		((RCC->AHBENR & (RCC_AHBENR_GPIOEEN)) != RESET)
						#define MY_RCC_GPIOE_IS_CLK_DISABLED()     		((RCC->AHBENR & (RCC_AHBENR_GPIOEEN)) == RESET)

						#define MY_RCC_GPIOE_FORCE_RESET()   			(RCC->AHBRSTR |= 	(RCC_AHBRSTR_GPIOERST))
						#define MY_RCC_GPIOE_RELEASE_RESET() 			(RCC->AHBRSTR &= ~(RCC_AHBRSTR_GPIOERST))

					#endif

					/* GPIOF */
					#define MY_RCC_GPIOF_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_GPIOFEN);
					#define MY_RCC_GPIOF_CLK_DISABLE()    			 	(RCC->AHBENR &= ~(RCC_AHBENR_GPIOFEN))

					#define MY_RCC_GPIOF_IS_CLK_ENABLED()     		 	((RCC->AHBENR & (RCC_AHBENR_GPIOFEN)) != RESET)
					#define MY_RCC_GPIOF_IS_CLK_DISABLED() 				((RCC->AHBENR & (RCC_AHBENR_GPIOFEN)) == RESET)

					#define MY_RCC_GPIOF_FORCE_RESET()   				(RCC->AHBRSTR |= (RCC_AHBRSTR_GPIOFRST))
					#define MY_RCC_GPIOF_RELEASE_RESET() 				(RCC->AHBRSTR &= ~(RCC_AHBRSTR_GPIOFRST))


					/* CRC */
					#define MY_RCC_CRC_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_CRCEN);
					#define MY_RCC_CRC_CLK_DISABLE()      			 	(RCC->AHBENR &= ~(RCC_AHBENR_CRCEN))

					#define MY_RCC_CRC_IS_CLK_ENABLED()       		 	((RCC->AHBENR & (RCC_AHBENR_CRCEN)) != RESET)
					#define MY_RCC_CRC_IS_CLK_DISABLED()      		 	((RCC->AHBENR & (RCC_AHBENR_CRCEN)) == RESET)


					/* DMA1 */
					#define MY_RCC_DMA1_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_DMA1EN);
					#define MY_RCC_DMA1_CLK_DISABLE()     			 	(RCC->AHBENR &= ~(RCC_AHBENR_DMA1EN))

					#define MY_RCC_DMA1_IS_CLK_ENABLED()      		 	((RCC->AHBENR & (RCC_AHBENR_DMA1EN)) != RESET)
					#define MY_RCC_DMA1_IS_CLK_DISABLED()     		 	((RCC->AHBENR & (RCC_AHBENR_DMA1EN)) == RESET)


					#if defined(STM32F091xC) || \
						defined(STM32F098xx)

						/* DMA2 */
						#define MY_RCC_DMA2_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_DMA2EN);
						#define MY_RCC_DMA2_CLK_DISABLE()    			(RCC->AHBENR &= ~(RCC_AHBENR_DMA2EN))

						#define MY_RCC_DMA2_IS_CLK_ENABLED()       		((RCC->AHBENR & (RCC_AHBENR_DMA2EN)) != RESET)
						#define MY_RCC_DMA2_IS_CLK_DISABLED()      		((RCC->AHBENR & (RCC_AHBENR_DMA2EN)) == RESET)

					#endif


					/* SRAM */
					#define MY_RCC_SRAM_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_SRAMEN);
					#define MY_RCC_SRAM_CLK_DISABLE()     			 	(RCC->AHBENR &= ~(RCC_AHBENR_SRAMEN))

					#define MY_RCC_SRAM_IS_CLK_ENABLED()      		 	((RCC->AHBENR & (RCC_AHBENR_SRAMEN)) != RESET)
					#define MY_RCC_SRAM_IS_CLK_DISABLED()     		 	((RCC->AHBENR & (RCC_AHBENR_SRAMEN)) == RESET)

					/* FLITF */
					#define MY_RCC_FLITF_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_FLITFEN);
					#define MY_RCC_FLITF_CLK_DISABLE()    			 	(RCC->AHBENR &= ~(RCC_AHBENR_FLITFEN))

					#define MY_RCC_FLITF_IS_CLK_ENABLED()     		 	((RCC->AHBENR & (RCC_AHBENR_FLITFEN)) != RESET)
					#define MY_RCC_FLITF_IS_CLK_DISABLED()    		 	((RCC->AHBENR & (RCC_AHBENR_FLITFEN)) == RESET)


					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

						/* TSC */
						#define MY_RCC_TSC_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->AHBENR, RCC_AHBENR_TSCEN);
						#define MY_RCC_TSC_CLK_DISABLE()        		(RCC->AHBENR &= ~(RCC_AHBENR_TSCEN))

						#define MY_RCC_TSC_IS_CLK_ENABLED()        		((RCC->AHBENR & (RCC_AHBENR_TSCEN)) != RESET)
						#define MY_RCC_TSC_IS_CLK_DISABLED()       		((RCC->AHBENR & (RCC_AHBENR_TSCEN)) == RESET)

						#define MY_RCC_TSC_FORCE_RESET()     			(RCC->AHBRSTR |= (RCC_AHBRSTR_TSCRST))
						#define MY_RCC_TSC_RELEASE_RESET()   			(RCC->AHBRSTR &= ~(RCC_AHBRSTR_TSCRST))

					#endif

				/**
				 * @} AHB
				 */


				/**
				 * @brief	Быстрые макросы для включения/выключения и проверки тактирования на шине APB1
				 * @note   	После сброса тактирование периферии (используемая в т.ч. для чтения/записи регистров) отключается,
			     *			и перед использованием периферии тактирование должно включаться вручную.
			     * @{
			     */
					#define MY_RCC_APB1_FORCE_RESET()     				(RCC->APB1RSTR = 0xFFFFFFFFU)
					#define MY_RCC_APB1_RELEASE_RESET()   				(RCC->APB1RSTR = 0x00000000U)


					#if defined(STM32F031x6) || \
						defined(STM32F038xx) || \
						defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

						/* TIM2 */
						#define MY_RCC_TIM2_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_TIM2EN);
						#define MY_RCC_TIM2_CLK_DISABLE()   			(RCC->APB1ENR &= ~(RCC_APB1ENR_TIM2EN))

						#define MY_RCC_TIM2_IS_CLK_ENABLED()       		((RCC->APB1ENR & (RCC_APB1ENR_TIM2EN)) != RESET)
						#define MY_RCC_TIM2_IS_CLK_DISABLED()      		((RCC->APB1ENR & (RCC_APB1ENR_TIM2EN)) == RESET)

