megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
						#define MY_RCC_TIM2_FORCE_RESET()     			(RCC->APB1RSTR |= (RCC_APB1RSTR_TIM2RST))
						#define MY_RCC_TIM2_RELEASE_RESET()   			(RCC->APB1RSTR &= ~(RCC_APB1RSTR_TIM2RST))

					#endif


					/* TIM3 */
					#define MY_RCC_TIM3_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_TIM3EN);
					#define MY_RCC_TIM3_CLK_DISABLE()   				(RCC->APB1ENR &= ~(RCC_APB1ENR_TIM3EN))

					#define MY_RCC_TIM3_IS_CLK_ENABLED()   				((RCC->APB1ENR & (RCC_APB1ENR_TIM3EN)) != RESET)
					#define MY_RCC_TIM3_IS_CLK_DISABLED()  				((RCC->APB1ENR & (RCC_APB1ENR_TIM3EN)) == RESET)

					#define MY_RCC_TIM3_FORCE_RESET()     			 	(RCC->APB1RSTR |= (RCC_APB1RSTR_TIM3RST))
					#define MY_RCC_TIM3_RELEASE_RESET()   			 	(RCC->APB1RSTR &= ~(RCC_APB1RSTR_TIM3RST))


					#if defined(STM32F030x8) || \
						defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F070xB) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* TIM6 */
						#define MY_RCC_TIM6_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_TIM6EN);
						#define MY_RCC_TIM6_CLK_DISABLE()   			(RCC->APB1ENR &= ~(RCC_APB1ENR_TIM6EN))

						#define MY_RCC_TIM6_IS_CLK_ENABLED()       		((RCC->APB1ENR & (RCC_APB1ENR_TIM6EN)) != RESET)
						#define MY_RCC_TIM6_IS_CLK_DISABLED()      		((RCC->APB1ENR & (RCC_APB1ENR_TIM6EN)) == RESET)

						#define MY_RCC_TIM6_FORCE_RESET()     			(RCC->APB1RSTR |=  (RCC_APB1RSTR_TIM6RST))
						#define MY_RCC_TIM6_RELEASE_RESET()   		 	(RCC->APB1RSTR &= ~(RCC_APB1RSTR_TIM6RST))


						/* I2C2 */
						#define MY_RCC_I2C2_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_I2C2EN);
						#define MY_RCC_I2C2_CLK_DISABLE()   			(RCC->APB1ENR &= ~(RCC_APB1ENR_I2C2EN))

						#define MY_RCC_I2C2_IS_CLK_ENABLED()       		((RCC->APB1ENR & (RCC_APB1ENR_I2C2EN)) != RESET)
						#define MY_RCC_I2C2_IS_CLK_DISABLED()      		((RCC->APB1ENR & (RCC_APB1ENR_I2C2EN)) == RESET)

						#define MY_RCC_I2C2_FORCE_RESET()     			(RCC->APB1RSTR |= (RCC_APB1RSTR_I2C2RST))
						#define MY_RCC_I2C2_RELEASE_RESET()   			(RCC->APB1RSTR &= ~(RCC_APB1RSTR_I2C2RST))

					#endif


					/* TIM14 */
					#define MY_RCC_TIM14_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_TIM14EN);
					#define MY_RCC_TIM14_CLK_DISABLE()  				(RCC->APB1ENR &= ~(RCC_APB1ENR_TIM14EN))

					#define MY_RCC_TIM14_IS_CLK_ENABLED()  				((RCC->APB1ENR & (RCC_APB1ENR_TIM14EN)) != RESET)
					#define MY_RCC_TIM14_IS_CLK_DISABLED() 				((RCC->APB1ENR & (RCC_APB1ENR_TIM14EN)) == RESET)

					#define MY_RCC_TIM14_FORCE_RESET()    			 	(RCC->APB1RSTR |= (RCC_APB1RSTR_TIM14RST))
					#define MY_RCC_TIM14_RELEASE_RESET()  			 	(RCC->APB1RSTR &= ~(RCC_APB1RSTR_TIM14RST))


					/* WWDG */
					#define MY_RCC_WWDG_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_WWDGEN);
					#define MY_RCC_WWDG_CLK_DISABLE()   				(RCC->APB1ENR &= ~(RCC_APB1ENR_WWDGEN))

					#define MY_RCC_WWDG_IS_CLK_ENABLED()   				((RCC->APB1ENR & (RCC_APB1ENR_WWDGEN)) != RESET)
					#define MY_RCC_WWDG_IS_CLK_DISABLED()  				((RCC->APB1ENR & (RCC_APB1ENR_WWDGEN)) == RESET)

					#define MY_RCC_WWDG_FORCE_RESET()     			 	(RCC->APB1RSTR |= (RCC_APB1RSTR_WWDGRST))
					#define MY_RCC_WWDG_RELEASE_RESET()   			 	(RCC->APB1RSTR &= ~(RCC_APB1RSTR_WWDGRST))


					/* I2C1 */
					#define MY_RCC_I2C1_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_I2C1EN);
					#define MY_RCC_I2C1_CLK_DISABLE()   				(RCC->APB1ENR &= ~(RCC_APB1ENR_I2C1EN))

					#define MY_RCC_I2C1_IS_CLK_ENABLED()   				((RCC->APB1ENR & (RCC_APB1ENR_I2C1EN)) != RESET)
					#define MY_RCC_I2C1_IS_CLK_DISABLED()  				((RCC->APB1ENR & (RCC_APB1ENR_I2C1EN)) == RESET)

					#define MY_RCC_I2C1_FORCE_RESET()     			 	(RCC->APB1RSTR |= (RCC_APB1RSTR_I2C1RST))
					#define MY_RCC_I2C1_RELEASE_RESET()   			 	(RCC->APB1RSTR &= ~(RCC_APB1RSTR_I2C1RST))


					/* PWR */
					#define MY_RCC_PWR_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_PWREN);
					#define MY_RCC_PWR_CLK_DISABLE()    				(RCC->APB1ENR &= ~(RCC_APB1ENR_PWREN))

					#define MY_RCC_PWR_IS_CLK_ENABLED()    				((RCC->APB1ENR & (RCC_APB1ENR_PWREN)) != RESET)
					#define MY_RCC_PWR_IS_CLK_DISABLED()   				((RCC->APB1ENR & (RCC_APB1ENR_PWREN)) == RESET)

					#define MY_RCC_PWR_FORCE_RESET()      			 	(RCC->APB1RSTR |= (RCC_APB1RSTR_PWRRST))
					#define MY_RCC_PWR_RELEASE_RESET()    			 	(RCC->APB1RSTR &= ~(RCC_APB1RSTR_PWRRST))


					#if defined(STM32F030x8) || \
						defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F070x6) || \
						defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F070xB) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* USART2 */
						#define MY_RCC_USART2_CLK_ENABLE()   			MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_USART2EN);
						#define MY_RCC_USART2_CLK_DISABLE() 			(RCC->APB1ENR &= ~(RCC_APB1ENR_USART2EN))

						#define MY_RCC_USART2_IS_CLK_ENABLED()     		((RCC->APB1ENR & (RCC_APB1ENR_USART2EN)) != RESET)
						#define MY_RCC_USART2_IS_CLK_DISABLED()    		((RCC->APB1ENR & (RCC_APB1ENR_USART2EN)) == RESET)

						#define MY_RCC_USART2_FORCE_RESET()   			(RCC->APB1RSTR |= (RCC_APB1RSTR_USART2RST))
						#define MY_RCC_USART2_RELEASE_RESET() 			(RCC->APB1RSTR &= ~(RCC_APB1RSTR_USART2RST))

					#endif


					#if defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F070xB) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* USART3 */
						#define MY_RCC_USART3_CLK_ENABLE()   			MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_USART3EN);
						#define MY_RCC_USART3_CLK_DISABLE() 			(RCC->APB1ENR &= ~(RCC_APB1ENR_USART3EN))

