megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
						#define MY_RCC_USART3_IS_CLK_ENABLED()     		((RCC->APB1ENR & (RCC_APB1ENR_USART3EN)) != RESET)
						#define MY_RCC_USART3_IS_CLK_DISABLED()    		((RCC->APB1ENR & (RCC_APB1ENR_USART3EN)) == RESET)

						#define MY_RCC_USART3_FORCE_RESET()   			(RCC->APB1RSTR |=  (RCC_APB1RSTR_USART3RST))
						#define MY_RCC_USART3_RELEASE_RESET() 			(RCC->APB1RSTR &= ~(RCC_APB1RSTR_USART3RST))


						/* USART4 */
						#define MY_RCC_USART4_CLK_ENABLE()    			MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_USART4EN);
						#define MY_RCC_USART4_CLK_DISABLE() 			(RCC->APB1ENR &= ~(RCC_APB1ENR_USART4EN))

						#define MY_RCC_USART4_IS_CLK_ENABLED()     		((RCC->APB1ENR & (RCC_APB1ENR_USART4EN)) != RESET)
						#define MY_RCC_USART4_IS_CLK_DISABLED()    		((RCC->APB1ENR & (RCC_APB1ENR_USART4EN)) == RESET)

						#define MY_RCC_USART4_FORCE_RESET()   			(RCC->APB1RSTR |= (RCC_APB1RSTR_USART4RST))
						#define MY_RCC_USART4_RELEASE_RESET() 			(RCC->APB1RSTR &= ~(RCC_APB1RSTR_USART4RST))

					#endif


					#if defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* USART5 */
						#define MY_RCC_USART5_CLK_ENABLE()  			MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_USART5EN);
						#define MY_RCC_USART5_CLK_DISABLE()      		(RCC->APB1ENR &= ~(RCC_APB1ENR_USART5EN))

						#define MY_RCC_USART5_IS_CLK_ENABLED()     		((RCC->APB1ENR & (RCC_APB1ENR_USART5EN)) != RESET)
						#define MY_RCC_USART5_IS_CLK_DISABLED()    		((RCC->APB1ENR & (RCC_APB1ENR_USART5EN)) == RESET)

						#define MY_RCC_USART5_FORCE_RESET()    			(RCC->APB1RSTR |= (RCC_APB1RSTR_USART5RST))
						#define MY_RCC_USART5_RELEASE_RESET()  			(RCC->APB1RSTR &= ~(RCC_APB1RSTR_USART5RST))

					#endif


					#if defined(STM32F030x8) || \
						defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F070xB) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* SPI2 */
						#define MY_RCC_SPI2_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_SPI2EN);
						#define MY_RCC_SPI2_CLK_DISABLE()   			(RCC->APB1ENR &= ~(RCC_APB1ENR_SPI2EN))

						#define MY_RCC_SPI2_IS_CLK_ENABLED()       		((RCC->APB1ENR & (RCC_APB1ENR_SPI2EN)) != RESET)
						#define MY_RCC_SPI2_IS_CLK_DISABLED()      		((RCC->APB1ENR & (RCC_APB1ENR_SPI2EN)) == RESET)

						#define MY_RCC_SPI2_FORCE_RESET()     			(RCC->APB1RSTR |= (RCC_APB1RSTR_SPI2RST))
						#define MY_RCC_SPI2_RELEASE_RESET()   			(RCC->APB1RSTR &= ~(RCC_APB1RSTR_SPI2RST))

					#endif


					#if defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

						/* DAC1 */
						#define MY_RCC_DAC1_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_DACEN);
						#define MY_RCC_DAC1_CLK_DISABLE()   				(RCC->APB1ENR &= ~(RCC_APB1ENR_DACEN))

						#define MY_RCC_DAC1_IS_CLK_ENABLED()       			((RCC->APB1ENR & (RCC_APB1ENR_DAC1EN)) != RESET)
						#define MY_RCC_DAC1_IS_CLK_DISABLED()      			((RCC->APB1ENR & (RCC_APB1ENR_DAC1EN)) == RESET)

						#define MY_RCC_DAC1_FORCE_RESET()     				(RCC->APB1RSTR |= (RCC_APB1RSTR_DACRST))
						#define MY_RCC_DAC1_RELEASE_RESET()   		 		(RCC->APB1RSTR &= ~(RCC_APB1RSTR_DACRST))

					#endif


					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

						/* HDMI CEC */
						#define MY_RCC_CEC_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_CECEN);
						#define MY_RCC_CEC_CLK_DISABLE()    				(RCC->APB1ENR &= ~(RCC_APB1ENR_CECEN))

						#define MY_RCC_CEC_IS_CLK_ENABLED()        			((RCC->APB1ENR & (RCC_APB1ENR_CECEN)) != RESET)
						#define MY_RCC_CEC_IS_CLK_DISABLED()       			((RCC->APB1ENR & (RCC_APB1ENR_CECEN)) == RESET)

						#define MY_RCC_CEC_FORCE_RESET()      				(RCC->APB1RSTR |= (RCC_APB1RSTR_CECRST))
						#define MY_RCC_CEC_RELEASE_RESET()    				(RCC->APB1RSTR &= ~(RCC_APB1RSTR_CECRST))

					#endif


					#if defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F070xB) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* TIM7 */
						#define MY_RCC_TIM7_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_TIM7EN);
						#define MY_RCC_TIM7_CLK_DISABLE()   				(RCC->APB1ENR &= ~(RCC_APB1ENR_TIM7EN))

						#define MY_RCC_TIM7_IS_CLK_ENABLED()       			((RCC->APB1ENR & (RCC_APB1ENR_TIM7EN)) != RESET)
						#define MY_RCC_TIM7_IS_CLK_DISABLED()      			((RCC->APB1ENR & (RCC_APB1ENR_TIM7EN)) == RESET)

						#define MY_RCC_TIM7_FORCE_RESET()     				(RCC->APB1RSTR |=  (RCC_APB1RSTR_TIM7RST))
						#define MY_RCC_TIM7_RELEASE_RESET()   				(RCC->APB1RSTR &= ~(RCC_APB1RSTR_TIM7RST))

					#endif


					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F070x6) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F070xB)

						/* USB */
						#define MY_RCC_USB_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_USBEN);
						#define MY_RCC_USB_CLK_DISABLE()    				(RCC->APB1ENR &= ~(RCC_APB1ENR_USBEN))

						#define MY_RCC_USB_IS_CLK_ENABLED()        			((RCC->APB1ENR & (RCC_APB1ENR_USBEN)) != RESET)
						#define MY_RCC_USB_IS_CLK_DISABLED()       			((RCC->APB1ENR & (RCC_APB1ENR_USBEN)) == RESET)

						#define MY_RCC_USB_FORCE_RESET()      		  		(RCC->APB1RSTR |= (RCC_APB1RSTR_USBRST))
						#define MY_RCC_USB_RELEASE_RESET()    				(RCC->APB1RSTR &= ~(RCC_APB1RSTR_USBRST))

					#endif


					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F072xB) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

