megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
						/* CAN1 */
						#define MY_RCC_CAN1_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_CANEN);
						#define MY_RCC_CAN1_CLK_DISABLE()    				(RCC->APB1ENR &= ~(RCC_APB1ENR_CANEN))

						#define MY_RCC_CAN1_IS_CLK_ENABLED()       			((RCC->APB1ENR & (RCC_APB1ENR_CAN1EN)) != RESET)
						#define MY_RCC_CAN1_IS_CLK_DISABLED()      			((RCC->APB1ENR & (RCC_APB1ENR_CAN1EN)) == RESET)

						#define MY_RCC_CAN1_FORCE_RESET()       			(RCC->APB1RSTR |= (RCC_APB1RSTR_CANRST))
						#define MY_RCC_CAN1_RELEASE_RESET()     			(RCC->APB1RSTR &= ~(RCC_APB1RSTR_CANRST))

					#endif


					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx)

						/* CRS */
						#define MY_RCC_CRS_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB1ENR, RCC_APB1ENR_CRSEN);
						#define MY_RCC_CRS_CLK_DISABLE()    				(RCC->APB1ENR &= ~(RCC_APB1ENR_CRSEN))

						#define MY_RCC_CRS_IS_CLK_ENABLED()        			((RCC->APB1ENR & (RCC_APB1ENR_CRSEN)) != RESET)
						#define MY_RCC_CRS_IS_CLK_DISABLED()       			((RCC->APB1ENR & (RCC_APB1ENR_CRSEN)) == RESET)

						#define MY_RCC_CRS_FORCE_RESET()      		  		(RCC->APB1RSTR |= (RCC_APB1RSTR_CRSRST))
						#define MY_RCC_CRS_RELEASE_RESET()    				(RCC->APB1RSTR &= ~(RCC_APB1RSTR_CRSRST))

					#endif

				/**
				 * @} APB1
				 */


				/**
				 * @brief 	Быстрые макросы для включения/выключения и проверки тактирования на шине APB2
				 * @note   	После сброса тактирование периферии (используемая в т.ч. для чтения/записи регистров) отключается,
				 *			и перед использованием периферии тактирование должно включаться вручную.
				 * @{
				 */
					#define MY_RCC_APB2_FORCE_RESET()     					(RCC->APB2RSTR = 0xFFFFFFFFU)
					#define MY_RCC_APB2_RELEASE_RESET()   					(RCC->APB2RSTR = 0x00000000U)

					/* SYSCFG */
					#define MY_RCC_SYSCFG_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN);
					#define MY_RCC_SYSCFG_CLK_DISABLE() 				 	(RCC->APB2ENR &= ~(RCC_APB2ENR_SYSCFGEN))

					#define MY_RCC_SYSCFG_IS_CLK_ENABLED()     		 		((RCC->APB2ENR & (RCC_APB2ENR_SYSCFGEN)) != RESET)
					#define MY_RCC_SYSCFG_IS_CLK_DISABLED()    		 		((RCC->APB2ENR & (RCC_APB2ENR_SYSCFGEN)) == RESET)

					#define MY_RCC_SYSCFG_FORCE_RESET()   		   			(RCC->APB2RSTR |= (RCC_APB2RSTR_SYSCFGRST))
					#define MY_RCC_SYSCFG_RELEASE_RESET() 		   			(RCC->APB2RSTR &= ~(RCC_APB2RSTR_SYSCFGRST))


					/* ADC1 */
					#define MY_RCC_ADC1_CLK_ENABLE()   						MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_ADC1EN);
					#define MY_RCC_ADC1_CLK_DISABLE()   				 	(RCC->APB2ENR &= ~(RCC_APB2ENR_ADC1EN))

					#define MY_RCC_ADC1_IS_CLK_ENABLED()        	 		((RCC->APB2ENR & (RCC_APB2ENR_ADC1EN)) != RESET)
					#define MY_RCC_ADC1_IS_CLK_DISABLED()       	 		((RCC->APB2ENR & (RCC_APB2ENR_ADC1EN)) == RESET)

					#define MY_RCC_ADC1_FORCE_RESET()     			 	  	(RCC->APB2RSTR |= (RCC_APB2RSTR_ADC1RST))
					#define MY_RCC_ADC1_RELEASE_RESET()   			 	  	(RCC->APB2RSTR &= ~(RCC_APB2RSTR_ADC1RST))


					/* TIM1 */
					#define MY_RCC_TIM1_CLK_ENABLE()  						MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_TIM1EN);
					#define MY_RCC_TIM1_CLK_DISABLE()   				 	(RCC->APB2ENR &= ~(RCC_APB2ENR_TIM1EN))

					#define MY_RCC_TIM1_IS_CLK_ENABLED()        	 		((RCC->APB2ENR & (RCC_APB2ENR_TIM1EN)) != RESET)
					#define MY_RCC_TIM1_IS_CLK_DISABLED()       	 		((RCC->APB2ENR & (RCC_APB2ENR_TIM1EN)) == RESET)

					#define MY_RCC_TIM1_FORCE_RESET()     			 		(RCC->APB2RSTR |= (RCC_APB2RSTR_TIM1RST))
					#define MY_RCC_TIM1_RELEASE_RESET()   			 		(RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM1RST))


					/* SPI1 */
					#define MY_RCC_SPI1_CLK_ENABLE()   						MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_SPI1EN);
					#define MY_RCC_SPI1_CLK_DISABLE()   				 	(RCC->APB2ENR &= ~(RCC_APB2ENR_SPI1EN))

					#define MY_RCC_SPI1_IS_CLK_ENABLED()        	 		((RCC->APB2ENR & (RCC_APB2ENR_SPI1EN)) != RESET)
					#define MY_RCC_SPI1_IS_CLK_DISABLED()       	 		((RCC->APB2ENR & (RCC_APB2ENR_SPI1EN)) == RESET)

					#define MY_RCC_SPI1_FORCE_RESET()     			 	  	(RCC->APB2RSTR |= (RCC_APB2RSTR_SPI1RST))
					#define MY_RCC_SPI1_RELEASE_RESET()   			 		(RCC->APB2RSTR &= ~(RCC_APB2RSTR_SPI1RST))


					#if defined(STM32F030x8) || \
						defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F070x6) || \
						defined(STM32F051x8) || \
						defined(STM32F058xx) || \
						defined(STM32F071xB) || \
						defined(STM32F072xB) || \
						defined(STM32F078xx) || \
						defined(STM32F070xB) || \
						defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* TIM15 */
						#define MY_RCC_TIM15_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_TIM15EN);
						#define MY_RCC_TIM15_CLK_DISABLE()   				(RCC->APB2ENR &= ~(RCC_APB2ENR_TIM15EN))

						#define MY_RCC_TIM15_IS_CLK_ENABLED()      			((RCC->APB2ENR & (RCC_APB2ENR_TIM15EN)) != RESET)
						#define MY_RCC_TIM15_IS_CLK_DISABLED()     			((RCC->APB2ENR & (RCC_APB2ENR_TIM15EN)) == RESET)

						#define MY_RCC_TIM15_FORCE_RESET()    				(RCC->APB2RSTR |= (RCC_APB2RSTR_TIM15RST))
						#define MY_RCC_TIM15_RELEASE_RESET()  				(RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM15RST))

					#endif


					/* TIM16 */
					#define MY_RCC_TIM16_CLK_ENABLE()  						MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_TIM16EN);
					#define MY_RCC_TIM16_CLK_DISABLE()  				 	(RCC->APB2ENR &= ~(RCC_APB2ENR_TIM16EN))

					#define MY_RCC_TIM16_IS_CLK_ENABLED()       	 		((RCC->APB2ENR & (RCC_APB2ENR_TIM16EN)) != RESET)
					#define MY_RCC_TIM16_IS_CLK_DISABLED()      	 		((RCC->APB2ENR & (RCC_APB2ENR_TIM16EN)) == RESET)

					#define MY_RCC_TIM16_FORCE_RESET()    			 		(RCC->APB2RSTR |= (RCC_APB2RSTR_TIM16RST))
					#define MY_RCC_TIM16_RELEASE_RESET()  			 		(RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM16RST))


