megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
					/* TIM17 */
					#define MY_RCC_TIM17_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_TIM17EN);
					#define MY_RCC_TIM17_CLK_DISABLE()  				 	(RCC->APB2ENR &= ~(RCC_APB2ENR_TIM17EN))

					#define MY_RCC_TIM17_IS_CLK_ENABLED()      		 		((RCC->APB2ENR & (RCC_APB2ENR_TIM17EN)) != RESET)
					#define MY_RCC_TIM17_IS_CLK_DISABLED()     		 		((RCC->APB2ENR & (RCC_APB2ENR_TIM17EN)) == RESET)

					#define MY_RCC_TIM17_FORCE_RESET()    			 		(RCC->APB2RSTR |= (RCC_APB2RSTR_TIM17RST))
					#define MY_RCC_TIM17_RELEASE_RESET()  			 		(RCC->APB2RSTR &= ~(RCC_APB2RSTR_TIM17RST))


					/* USART1 */
					#define MY_RCC_USART1_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_USART1EN);
					#define MY_RCC_USART1_CLK_DISABLE() 				 	(RCC->APB2ENR &= ~(RCC_APB2ENR_USART1EN))

					#define MY_RCC_USART1_IS_CLK_ENABLED()      	 		((RCC->APB2ENR & (RCC_APB2ENR_USART1EN)) != RESET)
					#define MY_RCC_USART1_IS_CLK_DISABLED()     	 		((RCC->APB2ENR & (RCC_APB2ENR_USART1EN)) == RESET)

					#define MY_RCC_USART1_FORCE_RESET()   		 	 	  	(RCC->APB2RSTR |= (RCC_APB2RSTR_USART1RST))
					#define MY_RCC_USART1_RELEASE_RESET() 			 		(RCC->APB2RSTR &= ~(RCC_APB2RSTR_USART1RST))


					#if defined(STM32F091xC) || \
						defined(STM32F098xx) || \
						defined(STM32F030xC)

						/* USART6 */
						#define MY_RCC_USART6_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_USART6EN);
						#define MY_RCC_USART6_CLK_DISABLE()      			(RCC->APB2ENR &= ~(RCC_APB2ENR_USART6EN))

						#define MY_RCC_USART6_IS_CLK_ENABLED()     			((RCC->APB2ENR & (RCC_APB2ENR_USART6EN)) != RESET)
						#define MY_RCC_USART6_IS_CLK_DISABLED()    			((RCC->APB2ENR & (RCC_APB2ENR_USART6EN)) == RESET)

						#define MY_RCC_USART6_FORCE_RESET()    				(RCC->APB2RSTR |= (RCC_APB2RSTR_USART6RST))
						#define MY_RCC_USART6_RELEASE_RESET()  				(RCC->APB2RSTR &= ~(RCC_APB2RSTR_USART6RST))

					#endif


					#if defined(STM32F091xC) || \
						defined(STM32F098xx)

						/* USART7 */
						#define MY_RCC_USART7_CLK_ENABLE()   				MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_USART7EN);
						#define MY_RCC_USART7_CLK_DISABLE()  			 	(RCC->APB2ENR &= ~(RCC_APB2ENR_USART7EN))

						#define MY_RCC_USART7_IS_CLK_ENABLED()     			((RCC->APB2ENR & (RCC_APB2ENR_USART7EN)) != RESET)
						#define MY_RCC_USART7_IS_CLK_DISABLED()    			((RCC->APB2ENR & (RCC_APB2ENR_USART7EN)) == RESET)

						#define MY_RCC_USART7_FORCE_RESET()    				(RCC->APB2RSTR |= (RCC_APB2RSTR_USART7RST))
						#define MY_RCC_USART7_RELEASE_RESET()  				(RCC->APB2RSTR &= ~(RCC_APB2RSTR_USART7RST))


						/* USART8 */
						#define MY_RCC_USART8_CLK_ENABLE()  				MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_USART8EN);
						#define MY_RCC_USART8_CLK_DISABLE()      			(RCC->APB2ENR &= ~(RCC_APB2ENR_USART8EN))

						#define MY_RCC_USART8_IS_CLK_ENABLED()     			((RCC->APB2ENR & (RCC_APB2ENR_USART8EN)) != RESET)
						#define MY_RCC_USART8_IS_CLK_DISABLED()    			((RCC->APB2ENR & (RCC_APB2ENR_USART8EN)) == RESET)

						#define MY_RCC_USART8_FORCE_RESET()    				(RCC->APB2RSTR |= (RCC_APB2RSTR_USART8RST))
						#define MY_RCC_USART8_RELEASE_RESET()  		  		(RCC->APB2RSTR &= ~(RCC_APB2RSTR_USART8RST))

					#endif


					/* DBGMCU */
					#define MY_RCC_DBGMCU_CLK_ENABLE()   					MY_UTILS_SetBitWithRead(&RCC->APB2ENR, RCC_APB2ENR_DBGMCUEN);
					#define MY_RCC_DBGMCU_CLK_DISABLE() 				 	(RCC->APB2ENR &= ~(RCC_APB2ENR_DBGMCUEN))

					#define MY_RCC_DBGMCU_IS_CLK_ENABLED()      	 		((RCC->APB2ENR & (RCC_APB2ENR_DBGMCUEN)) != RESET)
					#define MY_RCC_DBGMCU_IS_CLK_DISABLED()     	 		((RCC->APB2ENR & (RCC_APB2ENR_DBGMCUEN)) == RESET)

					#define MY_RCC_DBGMCU_FORCE_RESET()   			 		(RCC->APB2RSTR |= (RCC_APB2RSTR_DBGMCURST))
					#define MY_RCC_DBGMCU_RELEASE_RESET() 			 		(RCC->APB2RSTR &= ~(RCC_APB2RSTR_DBGMCURST))

				/**
				 * @} APB2
				 */


				/**
				 * @brief 	Макросы для включения или отключения внутреннего высокоскоростного генератора (HSI).
				 * @note   	HSI остановлен при входе в режимы STOP и STANDBY.
				 * @note	HSI не может быть остановлен если используется в качестве источника системного тактирования.
				 * 			В случае когда нужно остановить HSI - нужно переключиться на другой источник тактирования - HSE или PLL.
				 * @note	После включения HSI необходимо обязательно дожидаться установки флага HSIRDY.
				 * @note	После отключения HSI, флаг HSIRDY снимается только через 6 тактов генератора HSI.
				 */
				#define RCC_HSI_OFF                             ((uint32_t)0x00000000U)         /*!< Отключение HSI осциллятора */
				#define RCC_HSI_ON                              RCC_CR_HSION           			/*!< Включение HSI осциллятора */

				#define MY_RCC_HSI_ENABLE()  		 			SET_BIT(RCC->CR, RCC_CR_HSION)
				#define MY_RCC_HSI_DISABLE() 					CLEAR_BIT(RCC->CR, RCC_CR_HSION)


				/**
				 * @defgroup Макросы для калибровки частоты внутреннего высокоскоростного генератора (HSI).
				 * @note   	Калибровка используется для компенсации изменений напряжения и температуры, которые влияют на частоту внутреннего HSI RC.
				 * @note			_HSICALIBRATIONVALUE_: указывает значение обрезки калибровки. (по умолчанию RCC_HSICALIBRATION_DEFAULT)
				 */
				#define RCC_HSICALIBRATION_DEFAULT              ((uint8_t)0x00000010U)         		/*!< Значение по умолчанию для калибровки HSI (calibration trimming value) */

				#define MY_RCC_HSI_CALIBRATIONVALUE_ADJUST(__RCC_HSICALIBRATION_VALUE__) \
																							MODIFY_REG(RCC->CR, RCC_CR_HSITRIM, (uint32_t)(__RCC_HSICALIBRATION_VALUE__) << RCC_CR_HSITRIM_BITNUMBER)


				/**
				 * @brief  Макрос для включения или выключения тактирования HSI48
				 * @note   Тактирование HSI48 останавливается аппаратно если происходит переход в режим STOP или STANDBY.
				 * @note   HSI48 не может быть остановлен если используется в качестве источника системного тактирования.
				 *		   В этом случае необходимо выбрать другой источник тактирования и только потом останавливать HSI48.
				 * @note   После включения HSI48 необходимо дожидаться флага HSI48RDY который указывает что HSI48 стабилен и может использоваться
				 *		   в качестве системного тактирования. Это не важно если используется функция инициализации MY_RCC_OscConfig().
				 * @note   Когда HSI48 остановлен, HSI48RDY флаг снимается только через 6 HSI48 циклов тактирования.
				 */
				#if defined(STM32F042x6) || \
					defined(STM32F048xx) || \
					defined(STM32F071xB) || \
					defined(STM32F072xB) || \
					defined(STM32F078xx) || \
					defined(STM32F091xC) || \
					defined(STM32F098xx)

					/** @brief  Макросы для установки и запроса состояния HSI48
					 * @retval  Может быть двух значений:
					 *          @arg RCC_HSI48_ON:  HSI48 включен
					 *          @arg RCC_HSI48_OFF: HSI48 выключен
					 */
					#define RCC_HSI48_OFF                 		((uint8_t)0x00)
					#define RCC_HSI48_ON                  		((uint8_t)0x01

					#define MY_RCC_HSI48_ENABLE()  				SET_BIT(RCC->CR2, RCC_CR2_HSI48ON)
					#define MY_RCC_HSI48_DISABLE() 				CLEAR_BIT(RCC->CR2, RCC_CR2_HSI48ON)

					#define MY_RCC_GET_HSI48_STATE()          	(((uint32_t)(READ_BIT(RCC->CFGR3, RCC_CR2_HSI48ON)) != RESET) ?  RCC_HSI48_ON : RCC_HSI48_OFF)

				#else

					/* HSI48 Настройка */
					#define RCC_HSI48_OFF                    	((uint8_t)0x00)

