megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
					#define MY_RCC_GET_HSI48_STATE()   			RCC_HSI_OFF

				#endif


				/**
				 * @brief  Макрос для настройки внешнего высокоскоростного генератора (HSE).
				 * @note   Переход от HSE Bypass к HSE On/HSE On к HSE Bypass не поддерживается в этом макросе.
				 *         Пользователь должен сначала перейти к HSE Off, а потом HSE On или HSE Bypass.
				 * @note   После включения HSE (RCC_HSE_ON или RCC_HSE_Bypass), необходимо программно дождаться
				 *         установки флага HSERDY, указывающего, что тактирование стабильно и может использоваться для PLL или/и системного тактирования.
				 * @note   Состояние HSE не может быть изменено пока используется в качестве системного тактирования.
				 *         В этом случае, вы должны переключиться на другой источник тактирование если хотите изменить его состояние (напр.отключить его).
				 * @note   Тактирование HSE останавливается аппаратно когда МК входит в режим STOP и STANDBY.
				 * @note   Эта функция сбрасывает бит Clock Security System ON, если CSS была включена ранее,
				 *         нужно включить её вручную после вызова этой функции.
				 * @param  STATE - устанавливает новое состояние HSE.
				 *         Этот параметр может быть следующих значения:
				 *            @arg @ref RCC_HSE_OFF    - выключает HSE осциллятор, HSERDY флаг снимается после 6 циклов осциллятора.
				 *            @arg @ref RCC_HSE_ON     - включает HSE осциллятор.
				 *            @arg @ref RCC_HSE_BYPASS - включает обход HSE осциллятора при использовании внешнего генератора
				 */

				#define RCC_HSE_OFF                             (0x00000000U)       /*!< HSE отключен */
				#define RCC_HSE_ON                              (0x00000001U)       /*!< HSE включен */
				#define RCC_HSE_BYPASS                          (0x00000005U)       /*!< Внешний источник тактирования для HSE */

				#define MY_RCC_HSE_CONFIG(__STATE__)            do { \
																	if ((__STATE__) == RCC_HSE_ON)                        \
																	{                                                     \
																		SET_BIT(RCC->CR, RCC_CR_HSEON);                   \
																	}                                                     \
																	else if ((__STATE__) == RCC_HSE_OFF)                  \
																	{                                                     \
																		CLEAR_BIT(RCC->CR, RCC_CR_HSEON);                 \
																		CLEAR_BIT(RCC->CR, RCC_CR_HSEBYP);                \
																	}                                                     \
																	else if ((__STATE__) == RCC_HSE_BYPASS)               \
																	{                                                     \
																		SET_BIT(RCC->CR, RCC_CR_HSEBYP);                  \
																		SET_BIT(RCC->CR, RCC_CR_HSEON);                   \
																	}                                                     \
																	else                                                  \
																	{                                                     \
																		CLEAR_BIT(RCC->CR, RCC_CR_HSEON);                 \
																		CLEAR_BIT(RCC->CR, RCC_CR_HSEBYP);                \
																	}                                                     \
																} \
																while(0U)


				/** @brief  Макрос для включения/выключения PLL
				 * @note   	После включения основного PLL прикладная программа должна дождаться установки флага PLLRDY,
				 *			указывающего, что тактирование PLL стабильно и может использоваться в качестве источника системного тактирования.
				 * @note   Основной PLL отключается аппаратно при входе в режимы STOP и STANDBY.
				 */

				#define RCC_PLL_NONE                         		(0x00000000U)  				/*!< PLL не задействован */
				#define RCC_PLL_OFF                          		(0x00000001U)  				/*!< PLL отключен */
				#define RCC_PLL_ON                           		(0x00000002U)  				/*!< PLL включен */

				#define MY_RCC_PLL_ENABLE() 						SET_BIT(RCC->CR, RCC_CR_PLLON)
				#define MY_RCC_PLL_DISABLE() 						CLEAR_BIT(RCC->CR, RCC_CR_PLLON)


				/** @brief  Макрос для конфигурирования источника тактирования для PLL, установки уможителей и делителей.
				 * @note   Эта функция должна выполняться только когда PLL отключен.
				 * @param  PLLSOURCE - устанавливает значение источника тактирования для PLL.
				 *         Этот параметр может принимать следующие значение:
				 *            @arg @ref RCC_PLLSOURCE_HSI - HSI
				 *            @arg @ref RCC_PLLSOURCE_HSE - HSE
				 * @param  PLLMUL - устанавливает умножитель для PLL VCO
				 *         Этот параметр может принимать следующие значение:
				 *          	@arg @ref RCC_PLL_MUL2 и RCC_PLL_MUL16.
				 * @param  PREDIV - устанавливает предделитель для PLL VCO
				 *         Этот параметр может принимать следующие значение
				 * 					@arg @ref RCC_PREDIV_DIV1 и RCC_PREDIV_DIV16
				 *
				 */
				#define RCC_PLLSOURCE_HSE           				RCC_CFGR_PLLSRC_HSE_PREDIV /*!< Тактовая частота HSE */


				/* Если используется HSI */
				#if defined(STM32F042x6) || \
					defined(STM32F048xx) || \
					defined(STM32F071xB) || \
					defined(STM32F072xB) || \
					defined(STM32F078xx) || \
					defined(STM32F091xC) || \
					defined(STM32F098xx)

					#define RCC_PLLSOURCE_HSI                		RCC_CFGR_PLLSRC_HSI_PREDIV
					#define RCC_PLLSOURCE_HSI48              		RCC_CFGR_PLLSRC_HSI48_PREDIV

				#else

					#if defined(STM32F070xB) || \
						defined(STM32F070x6) || \
						defined(STM32F030xC)

						#define RCC_PLLSOURCE_HSI              		RCC_CFGR_PLLSRC_HSI_PREDIV

					#else

						#define RCC_PLLSOURCE_HSI              		RCC_CFGR_PLLSRC_HSI_DIV2

					#endif

				#endif


				#define RCC_PLL_PREDIV_DIV1                  		RCC_CFGR2_PREDIV_DIV1
				#define RCC_PLL_PREDIV_DIV2                  		RCC_CFGR2_PREDIV_DIV2
				#define RCC_PLL_PREDIV_DIV3                 		RCC_CFGR2_PREDIV_DIV3
				#define RCC_PLL_PREDIV_DIV4                  		RCC_CFGR2_PREDIV_DIV4
				#define RCC_PLL_PREDIV_DIV5                  		RCC_CFGR2_PREDIV_DIV5
				#define RCC_PLL_PREDIV_DIV6                  		RCC_CFGR2_PREDIV_DIV6
				#define RCC_PLL_PREDIV_DIV7                  		RCC_CFGR2_PREDIV_DIV7
				#define RCC_PLL_PREDIV_DIV8                  		RCC_CFGR2_PREDIV_DIV8
				#define RCC_PLL_PREDIV_DIV9                  		RCC_CFGR2_PREDIV_DIV9
				#define RCC_PLL_PREDIV_DIV10                 		RCC_CFGR2_PREDIV_DIV10
				#define RCC_PLL_PREDIV_DIV11                 		RCC_CFGR2_PREDIV_DIV11
				#define RCC_PLL_PREDIV_DIV12                 		RCC_CFGR2_PREDIV_DIV12
				#define RCC_PLL_PREDIV_DIV13                 		RCC_CFGR2_PREDIV_DIV13
				#define RCC_PLL_PREDIV_DIV14                 		RCC_CFGR2_PREDIV_DIV14
				#define RCC_PLL_PREDIV_DIV15                 		RCC_CFGR2_PREDIV_DIV15
				#define RCC_PLL_PREDIV_DIV16                 		RCC_CFGR2_PREDIV_DIV16


				#define RCC_PLL_MUL2                        	 	RCC_CFGR_PLLMUL2
				#define RCC_PLL_MUL3                         		RCC_CFGR_PLLMUL3
				#define RCC_PLL_MUL4                         		RCC_CFGR_PLLMUL4
				#define RCC_PLL_MUL5                         		RCC_CFGR_PLLMUL5
				#define RCC_PLL_MUL6                        		RCC_CFGR_PLLMUL6
				#define RCC_PLL_MUL7                         		RCC_CFGR_PLLMUL7
				#define RCC_PLL_MUL8                         		RCC_CFGR_PLLMUL8
				#define RCC_PLL_MUL9                         		RCC_CFGR_PLLMUL9
				#define RCC_PLL_MUL10                        		RCC_CFGR_PLLMUL10
				#define RCC_PLL_MUL11                        		RCC_CFGR_PLLMUL11
				#define RCC_PLL_MUL12                        		RCC_CFGR_PLLMUL12
				#define RCC_PLL_MUL13                        		RCC_CFGR_PLLMUL13
				#define RCC_PLL_MUL14                        		RCC_CFGR_PLLMUL14
				#define RCC_PLL_MUL15                        		RCC_CFGR_PLLMUL15
				#define RCC_PLL_MUL16                        		RCC_CFGR_PLLMUL16


				#define MY_RCC_PLL_CONFIG(__RCC_PLLSOURCE__, __RCC_PLL_PREDIV__, __RCC_PLL_MUL__) \
																									do { \
																										MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PREDIV, (__RCC_PLL_PREDIV__)); \
																										MODIFY_REG(RCC->CFGR,  RCC_CFGR_PLLMUL | RCC_CFGR_PLLSRC, (uint32_t)((__RCC_PLL_MUL__)|(__RCC_PLLSOURCE__))); \
																									} \
																									while(0U)

				#define MY_RCC_GET_PLL_OSCSOURCE() 					((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_PLLSRC)))


				/**
				 * @brief  Отдельный макрос для настройки предделителя для HSE при использовании PLL - PLL PREDIV HSE
				 * @note   Коэффициент предделителя не может измениться если PLL используется как источник системного тактирования.
				 *         В этом случае нужно выбрать другой источник системного тактирования, отключить PLL и
				 *         тогда можете изменить предделитель HSE.
				 * @param  HSE_PREDIV_VALUE: устанавливаемое значение в качестве предделителя HSE.
				 *         Это параметр может быть установлен следующих значений между RCC_PLL_PREDIV_DIV1 и RCC_PLL_PREDIV_DIV16
				 */
				#define MY_RCC_HSE_PREDIV_CONFIG(__HSE_PREDIV_VALUE__)  MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PREDIV, (uint32_t)(__HSE_PREDIV_VALUE__))


