megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
				/** @brief  Макрос для получения источника тактирования используемого для системного тактирования.
				 * @retval  Источник тактирования SYSCLK. Возвращаемое значиение может быть одно из перечисленных:
				 *			@arg @ref RCC_SYSCLKSOURCE_STATUS_MSI    - MSI
				 *          @arg @ref RCC_SYSCLKSOURCE_STATUS_HSI    - HSI
				 *          @arg @ref RCC_SYSCLKSOURCE_STATUS_HSE    - HSE
				 *          @arg @ref RCC_SYSCLKSOURCE_STATUS_PLLCLK - PLL
				 */
				#define RCC_SYSCLKSOURCE_STATUS_HSI             		RCC_CFGR_SWS_HSI
				#define RCC_SYSCLKSOURCE_STATUS_HSE             		RCC_CFGR_SWS_HSE
				#define RCC_SYSCLKSOURCE_STATUS_PLLCLK          		RCC_CFGR_SWS_PLL


				#if defined(STM32F042x6) || \
					defined(STM32F048xx) || \
					defined(STM32F071xB) || \
					defined(STM32F072xB) || \
					defined(STM32F078xx) || \
					defined(STM32F091xC) || \
					defined(STM32F098xx)

					#define RCC_SYSCLKSOURCE_STATUS_HSI48   			RCC_CFGR_SWS_HSI48

				#endif


				#define MY_RCC_SYSCLK_CONFIG(__SYSCLKSOURCE__)  		MODIFY_REG(RCC->CFGR, RCC_CFGR_SW, (__SYSCLKSOURCE__))
				#define MY_RCC_GET_SYSCLK_SOURCE() 				      	((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_SWS)))


				/** @brief  Макроысы для включения или отключения внутреннего низкоскоростного генератора (LSI).
				 * @note   После включения LSI, необходимо обязательно дожидаться установки флага LSIRDY и его можно использовать для IWDG и/или RTC.
				 * @note   LSI нельзя отключить, если работает IWDG.
				 * @note   Когда LSI остановлен, флаг LSIRDY снимается после 6 тактов генератора LSI.
				 */
				#define RCC_LSI_OFF                             		(0x00000000U)   	/*!< Выключение LSI */
				#define RCC_LSI_ON                              		RCC_CSR_LSION   	/*!< Включение LSI */

				#define MY_RCC_LSI_ENABLE() 							SET_BIT(RCC->CSR, RCC_CSR_LSION)
				#define MY_RCC_LSI_DISABLE() 							CLEAR_BIT(RCC->CSR, RCC_CSR_LSION)


				/**
				 * @brief  Макрос для настройке внешнего низкоскоростного осциллятора (LSE).
				 * @note   Переход с LSE Bypass к LSE On и от LSE On к LSE Bypass не поддерживается в этом макросе.
				 * @note   Поскольку LSE находится в Backup domain и доступ к записи запрещен после сброса данного домена
				 *         вам нужно включить возможность записи используя функцию @ref MY_PWR_EnableBkUpAccess() перед конфигурированием LSE
				 *         (выполняется один раз после сброса).
				 * @note   После включения LSE (RCC_LSE_ON или RCC_LSE_BYPASS), пользовательское приложение
				 *         должно дождаться флаг LSERDY который показывает что LSE тактирование стабильно и может быть использовано
				 *         для тактирования RTC.
				 * @param  STATE - устанавливает новое состояние LSE.
				 *         Этот параметр может принимать следующие значения:
				 *            @arg @ref RCC_LSE_OFF    - отключаем LSE осциллятор, флаг LSERDY снимается после 6 тактов осциллятора LSE.
				 *            @arg @ref RCC_LSE_ON     - включаем LSE осциллятор.
				 *            @arg @ref RCC_LSE_BYPASS - LSE осциллятор использует внешний источник тактирования.
				 */

				#define RCC_LSE_OFF                      				(0x00000000U)       /*!< Отключение LSE */
				#define RCC_LSE_ON                       				(0x00000001U)       /*!< Включение LSE*/
				#define RCC_LSE_BYPASS                   				(0x00000005U)       /*!< Внешний источник тактирования для LSE */

				#define MY_RCC_LSE_CONFIG(__STATE__)            do {                                                  \
																	if ((__STATE__) == RCC_LSE_ON)                    \
																	{                                                 \
																		SET_BIT(RCC->BDCR, RCC_BDCR_LSEON);           \
																	}                                                 \
																	else if ((__STATE__) == RCC_LSE_OFF)              \
																	{                                                 \
																		CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);         \
																		CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);        \
																	}                                                 \
																	else if ((__STATE__) == RCC_LSE_BYPASS)           \
																	{                                                 \
																		SET_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);          \
																		SET_BIT(RCC->BDCR, RCC_BDCR_LSEON);           \
																	}                                                 \
																	else                                              \
																	{                                                 \
																		CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);         \
																		CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);        \
																	}                                                 \
																}                                                     \
																while(0U)


				/** @brief  Макрос для включение или отключение внутреннего 14Mhz High Speed осциллятора (HSI14).
				 * @note   HSI14 аппаратно останавливается при переходе в режиме STOP и STANDBY.
				 * @note   HSI14 не может быть остановлен, если используется в качестве источника тактирования.
				 *         В этом случае, необходимо выбрать другой источник тактирования и тогда остановить HSI14.
				 * @note   После включения HSI14 с MY_RCC_HSI14_ENABLE(), в пользовательской программе необходимо
				 *         дождаться установки флага HSI14RDY, что в свою очередь сигнализирует о том что частота стабильная и
				 *         его можно использовать в качестве источника тактирования (напр. ADC).
				 *					В вызове данной функции нет необходимости если используется MY_RCC_OscConfig().
				 * @note   Когда HSI14 остановлен, флаг HSI14RDY снимается после 6 тактов HSI14 осциллятора.
				 */
				#define RCC_HSI14_OFF                        	(0x00000000U)
				#define RCC_HSI14_ON                         	RCC_CR2_HSI14ON

				#define MY_RCC_HSI14_ENABLE()  	 			  	SET_BIT(RCC->CR2,   RCC_CR2_HSI14ON)
				#define MY_RCC_HSI14_DISABLE() 	 			  	CLEAR_BIT(RCC->CR2, RCC_CR2_HSI14ON)


				/** @brief  Макрос для включения или отключения HSI14 при использовании ADC.
				 */
				#define RCC_HSI14_ADC_CONTROL                	(~RCC_CR2_HSI14DIS)

				#define MY_RCC_HSI14ADC_ENABLE()  				CLEAR_BIT(RCC->CR2, RCC_CR2_HSI14DIS)
				#define MY_RCC_HSI14ADC_DISABLE() 				SET_BIT(RCC->CR2,   RCC_CR2_HSI14DIS)


