megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
				/** @brief  Макрос для калибровки HSI14.
				 * @note   Калибровка используется для компенсации изменений напряжения и температуры, которые влияют на частоту внутреннего HSI14 RC.
				 * @param  HSI14CalibrationValue: указывает значение для калибровки, (по умолчанию, RCC_HSI14CALIBRATION_DEFAULT).
				 *         Этот параметр должен быть числом от 0 до 0x1F.
				 */
				#define RCC_HSI14CALIBRATION_DEFAULT         	(0x10U)   /*!< Значение по умолчанию для калибровки HSI14 (calibration trimming value) */

				#define MY_RCC_HSI14_CALIBRATIONVALUE_ADJUST(__HSI14_CALIBRATION_VALUE__) \
																MODIFY_REG(RCC->CR2, RCC_CR2_HSI14TRIM, (uint32_t)(__HSI14_CALIBRATION_VALUE__) << RCC_CR2_HSI14TRIM_BITNUMBER)


				/** @brief  Макрос для конфигурации источника тактирования USART1 (USART1CLK).
				 * @param  USART1CLKSource: указывает источник тактирования USART1.
				 *         Этот параметр может быть одним из:
				 *            @arg RCC_USART1CLKSOURCE_PCLK1  - PCLK1
				 *            @arg RCC_USART1CLKSOURCE_HSI    - HSI
				 *            @arg RCC_USART1CLKSOURCE_SYSCLK - System Clock
				 *            @arg RCC_USART1CLKSOURCE_LSE    - LSE
				 */
				#define RCC_USART1CLKSOURCE_PCLK1            	RCC_CFGR3_USART1SW_PCLK
				#define RCC_USART1CLKSOURCE_SYSCLK           	RCC_CFGR3_USART1SW_SYSCLK
				#define RCC_USART1CLKSOURCE_LSE              	RCC_CFGR3_USART1SW_LSE
				#define RCC_USART1CLKSOURCE_HSI              	RCC_CFGR3_USART1SW_HSI

				#define MY_RCC_USART1_CONFIG(__USART1_CLKSOURCE__) \
																MODIFY_REG(RCC->CFGR3, RCC_CFGR3_USART1SW, (uint32_t)(__USART1_CLKSOURCE__))

				#define MY_RCC_GET_USART1_SOURCE() 				((uint32_t)(READ_BIT(RCC->CFGR3, RCC_CFGR3_USART1SW)))


				/** @brief  Макрос для конфигурации источника тактирования USART2 (USART2CLK).
				 * @param  USART1CLKSource: указывает источник тактирования USART2.
				 *         Этот параметр может быть одним из:
				 *            @arg RCC_USART2CLKSOURCE_PCLK1  - PCLK1
				 *            @arg RCC_USART2CLKSOURCE_HSI    - HSI
				 *            @arg RCC_USART2CLKSOURCE_SYSCLK - System Clock
				 *            @arg RCC_USART2CLKSOURCE_LSE    - LSE
				 */
				#if defined(STM32F071xB) || \
					defined(STM32F072xB) || \
					defined(STM32F078xx) || \
					defined(STM32F091xC) || \
					defined(STM32F098xx)

					#define RCC_USART2CLKSOURCE_PCLK1       	RCC_CFGR3_USART2SW_PCLK
					#define RCC_USART2CLKSOURCE_SYSCLK       	RCC_CFGR3_USART2SW_SYSCLK
					#define RCC_USART2CLKSOURCE_LSE          	RCC_CFGR3_USART2SW_LSE
					#define RCC_USART2CLKSOURCE_HSI          	RCC_CFGR3_USART2SW_HSI

					#define MY_RCC_USART2_CONFIG(__USART2_CLKSOURCE__)   \
																MODIFY_REG(RCC->CFGR3, RCC_CFGR3_USART2SW, (uint32_t)(__USART2_CLKSOURCE__))

					#define MY_RCC_GET_USART2_SOURCE() 			((uint32_t)(READ_BIT(RCC->CFGR3, RCC_CFGR3_USART2SW)))

				#endif


				/** @brief  Макрос для конфигурации источника тактирования USART2 (USART2CLK).
				 * @param  USART1CLKSource: указывает источник тактирования USART2.
				 *         Этот параметр может быть одним из:
				 *            @arg RCC_USART2CLKSOURCE_PCLK1  - PCLK1
				 *            @arg RCC_USART2CLKSOURCE_HSI    - HSI
				 *            @arg RCC_USART2CLKSOURCE_SYSCLK - System Clock
				 *            @arg RCC_USART2CLKSOURCE_LSE    - LSE
				 */
				#if defined(STM32F091xC) || \
					defined(STM32F098xx)

					#define RCC_USART3CLKSOURCE_PCLK1        	RCC_CFGR3_USART3SW_PCLK
					#define RCC_USART3CLKSOURCE_SYSCLK       	RCC_CFGR3_USART3SW_SYSCLK
					#define RCC_USART3CLKSOURCE_LSE          	RCC_CFGR3_USART3SW_LSE
					#define RCC_USART3CLKSOURCE_HSI          	RCC_CFGR3_USART3SW_HSI

					#define MY_RCC_USART3_CONFIG(__USART3_CLKSOURCE__) \
																MODIFY_REG(RCC->CFGR3, RCC_CFGR3_USART3SW, (uint32_t)(__USART3_CLKSOURCE__))

					#define MY_RCC_GET_USART3_SOURCE() 			((uint32_t)(READ_BIT(RCC->CFGR3, RCC_CFGR3_USART3SW)))

				#endif


				/** @brief  Макрос для настройки источника тактирования I2C1 (I2C1CLK).
				 * @param  I2C1CLKSource: указывает источник тактирования I2C1.
				 *         Этот параметр может быть одним из:
				 *            @arg RCC_I2C1CLKSOURCE_HSI: 		- HSI
				 *            @arg RCC_I2C1CLKSOURCE_SYSCLK: - System Clock
				 */
				#define RCC_I2C1CLKSOURCE_HSI                	RCC_CFGR3_I2C1SW_HSI
				#define RCC_I2C1CLKSOURCE_SYSCLK             	RCC_CFGR3_I2C1SW_SYSCLK

				#define MY_RCC_I2C1_CONFIG(__I2C1_CLKSOURCE__)  MODIFY_REG(RCC->CFGR3, RCC_CFGR3_I2C1SW, (uint32_t)(__I2C1_CLKSOURCE__))

				#define MY_RCC_GET_I2C1_SOURCE() 				((uint32_t)(READ_BIT(RCC->CFGR3, RCC_CFGR3_I2C1SW)))


				/** @brief  Макрос для настройки тактирования USB (USBCLK).
				 * @param  __USB_CLKSOURCE__: устанавливает источник тактирования
				 *         Этот параметр может быть одним из:
				 *            @arg RCC_USBCLKSOURCE_HSI48:  HSI48 для USB (не доступен на STM32F070x6 & STM32F070xB)
				 *            @arg RCC_USBCLKSOURCE_PLLCLK: PLL
				 */
				#if defined(STM32F042x6) || \
					defined(STM32F048xx) || \
					defined(STM32F072xB) || \
					defined(STM32F078xx)

					#define RCC_USBCLKSOURCE_HSI48           	RCC_CFGR3_USBSW_HSI48
					#define RCC_USBCLKSOURCE_PLLCLK          	RCC_CFGR3_USBSW_PLLCLK

				#elif defined(STM32F070x6) || \
					defined(STM32F070xB)

					#define RCC_USBCLKSOURCE_PLLCLK          	RCC_CFGR3_USBSW_PLLCLK

				#endif


				#if defined(STM32F042x6) || \
					defined(STM32F048xx) || \
					defined(STM32F072xB) || \
					defined(STM32F078xx) || \
					defined(STM32F070x6) || \
					defined(STM32F070xB)

					#define MY_RCC_USB_CONFIG(__USB_CLKSOURCE__)   	MODIFY_REG(RCC->CFGR3, RCC_CFGR3_USBSW, (uint32_t)(__USB_CLKSOURCE__))

					#define MY_RCC_GET_USB_SOURCE() 				((uint32_t)(READ_BIT(RCC->CFGR3, RCC_CFGR3_USBSW)))

				#endif


				/** @brief 	Макрос для настройки тактирования RTC (RTCCLK).
				 * @note   Поскольку биты конфигурации часов RTC находятся в резервном домене,
				 *					и доступ к записи в этом домене после сброса запрещен, необходимо разрешить доступ на запись
				 *					с помощью макроса Power Backup Access, прежде чем настраивать источник часов RTC (это необходимо сделать один раз после сброса).
				 *
				 * @note   Как только тактирование RTC настроено - его нельзя изменить, пока
				 *					не будет сброшен резервный домен с помощью макроса MY_RCC_BACKUPRESET_FORCE() или с помощью сброса при включении питания (POR).
				 *
				 * @param  RTC_CLKSOURCE: указывает источник тактирования RTC
				 *         Этот параметр может быть одним из:
				 *             @arg RCC_RTCCLKSOURCE_NO_CLK: 		- без тактирования
				 *             @arg RCC_RTCCLKSOURCE_LSE: 				- LSE
				 *             @arg RCC_RTCCLKSOURCE_LSI: 				- LSI
				 *             @arg RCC_RTCCLKSOURCE_HSE_DIV32: 	- HSE деленый на 32
				 * @note   Если LSE или LSI использует в качестве источника тактирования RTC,
				 *					RTC продолжит работать в STOP и STANDBY режимах, и может использоваться в качестве источника wakeup.
				 *         Однако, когда LSI тактирование и HSE деленый на 32 используется в качестве источника тактирования RTC,
				 *         тогда RTC не может быть использован в STOP и STANDBY режимах.
				 * @note   Система всегда должна быть сконфигурирована так, чтобы получить частоту PCLK, большую или равную частоте RTCCLK для правильной работы RTC.
				 */
				#define RCC_RTCCLKSOURCE_NO_CLK              		(0x00000000U)          /*!< Без тактирования */
				#define RCC_RTCCLKSOURCE_LSE                 		RCC_BDCR_RTCSEL_LSE    /*!< RTC тактирование идёт с осциллятора LSE */
				#define RCC_RTCCLKSOURCE_LSI                 		RCC_BDCR_RTCSEL_LSI    /*!< RTC тактирование идёт с осциллятора LSI */
				#define RCC_RTCCLKSOURCE_HSE_DIV32          		RCC_BDCR_RTCSEL_HSE    /*!< RTC тактирование идёт с осциллятора HSE деленого на 32 */

