megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
				#define MY_RCC_RTC_CONFIG(__RTC_CLKSOURCE__) 		MODIFY_REG(RCC->BDCR, RCC_BDCR_RTCSEL, (__RTC_CLKSOURCE__))

				#define MY_RCC_GET_RTC_SOURCE() 					READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL)


			/** @brief  Макрос для включения/выключения тактирования для RTC.
			 * @note   Этот макрос может быть использован только после установки источника тактирования для RTC.
			 */
			#define MY_RCC_RTC_ENABLE() 							SET_BIT(RCC->BDCR, RCC_BDCR_RTCEN)
			#define MY_RCC_RTC_DISABLE() 							CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCEN)


			/** @brief  Макрос для сброса Backup domain.
			 * @note   Эта функция сбрасывает периферию RTC (включая backup-регистры)
			 *         и выбор тактирования для RTC в RCC_BDCR регистре.
			 */
			#define MY_RCC_BACKUPRESET_FORCE()  					SET_BIT(RCC->BDCR, RCC_BDCR_BDRST)
			#define MY_RCC_BACKUPRESET_RELEASE() 					CLEAR_BIT(RCC->BDCR, RCC_BDCR_BDRST)


			/** @brief  Макрос для конфигурации тактирования CEC.
			 * @param  __CECCLKSource__: указывается источник тактирования CEC .
			 *         Этот параметр может быть одним из:
			 *            @arg RCC_CECCLKSOURCE_HSI - HSI
			 *            @arg RCC_CECCLKSOURCE_LSE - LSE
			 */
			#if defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F051x8) || \
				defined(STM32F058xx) || \
				defined(STM32F071xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx)

				#define RCC_CECCLKSOURCE_HSI                		RCC_CFGR3_CECSW_HSI_DIV244
				#define RCC_CECCLKSOURCE_LSE                		RCC_CFGR3_CECSW_LSE


				#define MY_RCC_CEC_CONFIG(__RCC_CECCLKSOURCE__) 	MODIFY_REG(RCC->CFGR3, RCC_CFGR3_CECSW, (uint32_t)(__RCC_CECCLKSOURCE__))

				#define MY_RCC_GET_CEC_SOURCE() 					((uint32_t)(READ_BIT(RCC->CFGR3, RCC_CFGR3_CECSW)))

			#endif


			/** @brief  Включение/выключение прерываний RCC.
			 * @param  INTERRUPT: устанавливает разрешенные прерывания от RCC.
			 *         Этот параметр может быть одним из:
			 *            @arg RCC_IT_LSIRDY - Флаг прерывания LSI ready
			 *            @arg RCC_IT_LSERDY - Флаг прерывания LSE ready
			 *            @arg RCC_IT_HSIRDY - Флаг прерывания HSI ready
			 *            @arg RCC_IT_HSERDY - Флаг прерывания HSE ready
			 *            @arg RCC_IT_PLLRDY - Флаг прерывания PLL ready
			 *            @arg RCC_IT_HSI14RDY - Флаг прерывания HSI14 ready
			 *            @arg RCC_IT_HSI48RDY - Флаг прерывания HSI48 ready (только на STM32F0X2 с поддержкой USB)
			 */

			#define RCC_IT_LSIRDY                        		((uint8_t)RCC_CIR_LSIRDYF)   /*!< Флаг прерывания LSI Ready */
			#define RCC_IT_LSERDY                        		((uint8_t)RCC_CIR_LSERDYF)   /*!< Флаг прерывания LSE Ready */
			#define RCC_IT_HSIRDY                        		((uint8_t)RCC_CIR_HSIRDYF)   /*!< Флаг прерывания HSI Ready */
			#define RCC_IT_HSERDY                        		((uint8_t)RCC_CIR_HSERDYF)   /*!< Флаг прерывания HSE Ready */
			#define RCC_IT_PLLRDY                        		((uint8_t)RCC_CIR_PLLRDYF)   /*!< Флаг прерывания PLL Ready */
			#define RCC_IT_HSI14RDY                      		((uint8_t)RCC_CIR_HSI14RDYF) /*!< Флаг прерывания HSI14 Ready */
			#define RCC_IT_CSS                           		((uint8_t)RCC_CIR_CSSF)      /*!< Флаг прерывания Clock Security System */


			#if defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F071xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx)

				#define RCC_IT_HSI48                 			RCC_CIR_HSI48RDYF /*!< HSI48 Ready Interrupt flag */

			#endif


			#define MY_RCC_GET_IT(__INTERRUPT__) 				((RCC->CIR & (__INTERRUPT__)) == (__INTERRUPT__))
			#define MY_RCC_ENABLE_IT(__INTERRUPT__) 			(*(__IO uint8_t *) RCC_CIR_BYTE1_ADDRESS |= (__INTERRUPT__))
			#define MY_RCC_DISABLE_IT(__INTERRUPT__) 			(*(__IO uint8_t *) RCC_CIR_BYTE1_ADDRESS &= ~(__INTERRUPT__))
			#define MY_RCC_CLEAR_IT(__INTERRUPT__) 				(*(__IO uint8_t *) RCC_CIR_BYTE2_ADDRESS = (__INTERRUPT__))


			/** @brief  Проверка установлен тот или иной флаг в RCC
			 * @param  RCC_FLAG - параметр для установки того, какой флаг проверять.
			 *         Может принимать одно из значений:
			 *            @arg @ref RCC_FLAG_HSIRDY - HSI осциллятор готов
			 *            @arg @ref RCC_FLAG_HSERDY - HSE осциллятор готов
			 *            @arg @ref RCC_FLAG_PLLRDY - PLL готов
			 *            @arg @ref RCC_FLAG_HSI14RDY - HSI14 осциллятор готов
			 *            @arg @ref RCC_FLAG_LSERDY - LSE осциллятор готов
			 *            @arg @ref RCC_FLAG_LSIRDY - LSI осциллятор готов
			 *            @arg @ref RCC_FLAG_OBLRST - Сброс через Option Byte Load
			 *            @arg @ref RCC_FLAG_PINRST - Сброс через Reset Pin
			 *            @arg @ref RCC_FLAG_PORRST - Сброс через POR/PDR
			 *            @arg @ref RCC_FLAG_SFTRST - Программный сброс
			 *            @arg @ref RCC_FLAG_IWDGRST - Сброс через внешний независимый Watchdog
			 *            @arg @ref RCC_FLAG_WWDGRST - Сброс через оконный сторожевой Watchdog
			 *            @arg @ref RCC_FLAG_LPWRRST - Сброс от контроллера Low Power
			 * @retval Состояние флага, установлен ли он (TRUE или FALSE).
			 */

			#define RCC_FLAG_HSIRDY                      		((uint8_t)((CR_REG_INDEX << 5U) | RCC_CR_HSIRDY_BITNUMBER))
			#define RCC_FLAG_HSERDY                      		((uint8_t)((CR_REG_INDEX << 5U) | RCC_CR_HSERDY_BITNUMBER))
			#define RCC_FLAG_PLLRDY                      		((uint8_t)((CR_REG_INDEX << 5U) | RCC_CR_PLLRDY_BITNUMBER))
			#define RCC_FLAG_LSERDY                      		((uint8_t)((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSERDY_BITNUMBER))
			#define RCC_FLAG_HSI14RDY                    		((uint8_t)((CR2_REG_INDEX << 5U) | RCC_CR2_HSI14RDY_BITNUMBER))
			#define RCC_FLAG_LSIRDY                      		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_LSIRDY_BITNUMBER))
			#define RCC_FLAG_OBLRST                      		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_OBLRSTF_BITNUMBER))
			#define RCC_FLAG_PINRST                      		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_PINRSTF_BITNUMBER))
			#define RCC_FLAG_PORRST                      		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_PORRSTF_BITNUMBER))
			#define RCC_FLAG_SFTRST                      		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_SFTRSTF_BITNUMBER))
			#define RCC_FLAG_IWDGRST                     		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_IWDGRSTF_BITNUMBER))
			#define RCC_FLAG_WWDGRST                     		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_WWDGRSTF_BITNUMBER))
			#define RCC_FLAG_LPWRRST                     		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_LPWRRSTF_BITNUMBER))


			#if defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F071xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx)

