megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
				#define RCC_FLAG_HSI48RDY            			((uint8_t)((CR2_REG_INDEX << 5) | RCC_CR2_HSI48RDY_BITNUMBER))

			#endif


			#if defined(RCC_CSR_V18PWRRSTF)
				#define RCC_FLAG_V18PWRRST               		((uint8_t)((CSR_REG_INDEX << 5U) | RCC_CSR_V18PWRRSTF_BITNUMBER))	 /*!< Флаг сброса в домене питания V1.8 */
			#endif


			#define MY_RCC_GET_FLAG(__RCC_FLAG__) 			 	(((((__RCC_FLAG__) >> 5U) == CR_REG_INDEX   ) ? RCC->CR   :  \
																  (((__RCC_FLAG__) >> 5U) == CR2_REG_INDEX  ) ? RCC->CR2  :  \
																  (((__RCC_FLAG__) >> 5U) == BDCR_REG_INDEX ) ? RCC->BDCR :  \
																	RCC->CSR) & (1U << ((__RCC_FLAG__) & RCC_FLAG_MASK)))

			#define MY_RCC_CLEAR_RESET_FLAGS() 					(RCC->CSR |= RCC_CSR_RMVF)


			/** @brief  Макросы для конфигурирования пина MCO
			 * @param  __MCO_CLKSOURCE__: устанавливает источник тактирования
			 *         Параметр, в зависимости от используемого МК может быть следующим:
			 *            @arg RCC_MCOSOURCE_HSI - HSI
			 *            @arg RCC_MCOSOURCE_HSE - HSE
			 *            @arg RCC_MCOSOURCE_LSI - LSI
			 *            @arg RCC_MCOSOURCE_LSE - LSE
			 *            @arg RCC_MCOSOURCE_PLLCLK_NODIV - PLLCLK (проверяйте в документации поддерживается ли Вашим МК)
			 *            @arg RCC_MCOSOURCE_PLLCLK_DIV2 - PLLCLK деленый на 2
			 *            @arg RCC_MCOSOURCE_SYSCLK - System Clock
			 *            @arg RCC_MCOSOURCE_HSI14 - HSI14
			 *            @arg RCC_MCOSOURCE_HSI48 - HSI48
			 * @param  __MCO_DIV__: устанавливает предделитель для MCO (проверяйте в документации поддерживается ли Вашим МК)
			 *         Параметр, в зависимости от используемого МК может быть следующим:
			 *						 @arg RCC_MCODIV_1 -  делится на 1 в сериях STM32F030x8, STM32F051x8 и STM32F058xx
			 *            @arg RCC_MCO_DIV1 - делится на 1
			 *            @arg RCC_MCO_DIV2 - делится на 2
			 *            @arg RCC_MCO_DIV4 - делится на 4
			 *            @arg RCC_MCO_DIV8 - делится на 8
			 *            @arg RCC_MCO_DIV16 - делится на 16
			 *            @arg RCC_MCO_DIV32 - делится на 32
			 *            @arg RCC_MCO_DIV64 - делится на 64
			 *            @arg RCC_MCO_DIV128 - делится на 128
			 */

			/* Источники тактирования для вывода на MCO */
			#define RCC_MCO1SOURCE_NOCLOCK                		RCC_CFGR_MCO_NOCLOCK
			#define RCC_MCO1SOURCE_LSI                    		RCC_CFGR_MCO_LSI
			#define RCC_MCO1SOURCE_LSE                    		RCC_CFGR_MCO_LSE
			#define RCC_MCO1SOURCE_SYSCLK                 		RCC_CFGR_MCO_SYSCLK
			#define RCC_MCO1SOURCE_HSI                    		RCC_CFGR_MCO_HSI
			#define RCC_MCO1SOURCE_HSE                    		RCC_CFGR_MCO_HSE
			#define RCC_MCO1SOURCE_PLLCLK_DIV2            		RCC_CFGR_MCO_PLL
			#define RCC_MCO1SOURCE_HSI14                  		RCC_CFGR_MCO_HSI14


			#if defined(STM32F030xC) || \
				defined(STM32F030x6) || \
				defined(STM32F031x6) || \
				defined(STM32F038xx) || \
				defined(STM32F070x6) || \
				defined(STM32F070xB)

				#define RCC_MCOSOURCE_PLLCLK_NODIV   			(RCC_CFGR_MCO_PLL | RCC_CFGR_PLLNODIV)

			#elif defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F071xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx)

				#define RCC_MCOSOURCE_HSI48          			RCC_CFGR_MCO_HSI48
				#define RCC_MCOSOURCE_PLLCLK_NODIV   			(RCC_CFGR_MCO_PLL | RCC_CFGR_PLLNODIV)

			#endif


			/* Возможные варианты делителей для MCO */
			#if defined(STM32F030x8) || \
				defined(STM32F051x8) || \
				defined(STM32F058xx)

				#define RCC_MCODIV_1                    		((uint32_t)0x00000000)

			#elif defined(STM32F030x6) || \
				defined(STM32F031x6) || \
				defined(STM32F038xx) || \
				defined(STM32F070x6) || \
				defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F071xB) || \
				defined(STM32F070xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx) || \
				defined(STM32F030xC)

				#define RCC_MCO_DIV1                     		((uint32_t)0x00000000)
				#define RCC_MCO_DIV2                     		((uint32_t)0x10000000)
				#define RCC_MCO_DIV4                     		((uint32_t)0x20000000)
				#define RCC_MCO_DIV8                     		((uint32_t)0x30000000)
				#define RCC_MCO_DIV16                    		((uint32_t)0x40000000)
				#define RCC_MCO_DIV32                    		((uint32_t)0x50000000)
				#define RCC_MCO_DIV64                    		((uint32_t)0x60000000)
				#define RCC_MCO_DIV128                   		((uint32_t)0x70000000)

			#endif


			/* Макрос конфигурации MCO */
			#if defined(STM32F030xC) || \
				defined(STM32F030x6) || \
				defined(STM32F031x6) || \
				defined(STM32F038xx) || \
				defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F070x6) || \
				defined(STM32F070xB) || \
				defined(STM32F071xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx)

				#define MY_RCC_MCO_CONFIG(__MCO_CLKSOURCE__, __MCO_DIV__) \
																MODIFY_REG(RCC->CFGR, (RCC_CFGR_MCO | RCC_CFGR_MCOPRE), ((__MCO_CLKSOURCE__) | (__MCO_DIV__)))

			#else

				#define MY_RCC_MCO_CONFIG(__MCO_CLKSOURCE__, __MCO_DIV__)     MODIFY_REG(RCC->CFGR, RCC_CFGR_MCO, __MCO_CLKSOURCE__)

			#endif


			#if defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F071xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx)

				/** @defgroup Источники прерывания CRS
				 * @{
				 */
					#define RCC_CRS_IT_SYNCOK            			CRS_ISR_SYNCOKF    /*!< SYNC event OK */
					#define RCC_CRS_IT_SYNCWARN           			CRS_ISR_SYNCWARNF  /*!< SYNC warning */
					#define RCC_CRS_IT_ERR                			CRS_ISR_ERRF       /*!< error */
					#define RCC_CRS_IT_ESYNC              			CRS_ISR_ESYNCF     /*!< Expected SYNC */
					#define RCC_CRS_IT_TRIMOVF            			CRS_ISR_TRIMOVF    /*!< Trimming overflow or underflow */
					#define RCC_CRS_IT_SYNCERR            			CRS_ISR_SYNCERR    /*!< SYNC error */
					#define RCC_CRS_IT_SYNCMISS           			CRS_ISR_SYNCMISS   /*!< SYNC missed*/

					#define RCC_CRS_IT_ERROR_MASK             		((uint32_t)(RCC_CRS_IT_TRIMOVF | RCC_CRS_IT_SYNCERR | RCC_CRS_IT_SYNCMISS))

					#define MY_RCC_CRS_ENABLE_IT(__INTERRUPT__)   	(CRS->CR |=  (__INTERRUPT__))
					#define MY_RCC_CRS_DISABLE_IT(__INTERRUPT__)  	(CRS->CR &= ~(__INTERRUPT__))
					#define MY_RCC_CRS_GET_IT_SOURCE(__INTERRUPT__) ((CRS->CR &   (__INTERRUPT__))? SET : RESET)
					#define MY_RCC_CRS_CLEAR_IT(__INTERRUPT__)  	((((__INTERRUPT__) &  RCC_CRS_IT_ERROR_MASK)!= 0) ? \
																		(CRS->ICR |= CRS_ICR_ERRC) : \
																		(CRS->ICR |= (__INTERRUPT__)))
				/**
				 * @}
				 */


				/** @defgroup RCC CRS флаги
				 * @{
				 */
					#define RCC_CRS_FLAG_SYNCOK             		CRS_ISR_SYNCOKF     /* SYNC event OK flag     */
					#define RCC_CRS_FLAG_SYNCWARN           		CRS_ISR_SYNCWARNF   /* SYNC warning flag      */
					#define RCC_CRS_FLAG_ERR               			CRS_ISR_ERRF        /* Error flag        */
					#define RCC_CRS_FLAG_ESYNC              		CRS_ISR_ESYNCF      /* Expected SYNC flag     */
					#define RCC_CRS_FLAG_TRIMOVF            		CRS_ISR_TRIMOVF     /*!< Trimming overflow or underflow */
					#define RCC_CRS_FLAG_SYNCERR            		CRS_ISR_SYNCERR     /*!< SYNC error */
					#define RCC_CRS_FLAG_SYNCMISS           		CRS_ISR_SYNCMISS    /*!< SYNC missed*/

					#define RCC_CRS_FLAG_ERROR_MASK           		((uint32_t)(RCC_CRS_FLAG_TRIMOVF | RCC_CRS_FLAG_SYNCERR | RCC_CRS_FLAG_SYNCMISS))

					#define MY_RCC_CRS_GET_FLAG(__FLAG__)  			((CRS->ISR  & (__FLAG__)) == (__FLAG__))
					#define MY_RCC_CRS_CLEAR_FLAG(__FLAG__)   		((((__FLAG__) & RCC_CRS_FLAG_ERROR_MASK)!= 0) ? \
																		(CRS->ICR |= CRS_ICR_ERRC) : \
																		(CRS->ICR |= (__FLAG)))
				/**
				 * @}
				 */


				/**
				 * @brief  Включает тактирование для счетчика ошибок частоты
				 * @note   Когда бит CEN установлен, регистр CRS_CFGR становится защищенным от записи
				 * @retval Нет
				 */
				#define MY_RCC_CRS_ENABLE_FREQ_ERROR_COUNTER() 		(CRS->CR |= CRS_CR_CEN)


				/**
				 * @brief  Выключает тактирование для счетчика ошибок частоты
				 * @retval Нет
				 */
				#define MY_RCC_CRS_DISABLE_FREQ_ERROR_COUNTER()  	(CRS->CR &= ~CRS_CR_CEN)


				/**
				 * @brief  Включает аппаратную подстройку TRIM-битов.
				 * @note   При установке бита AUTOTRIMEN регистр CRS_CFGR становится защищенным от записи.
				 * @retval Нет
				 */
				#define MY_RCC_CRS_ENABLE_AUTOMATIC_CALIB()  		(CRS->CR |= CRS_CR_AUTOTRIMEN)


				/**
				 * @brief  Отключает аппаратную подстройку TRIM-битов.
				 * @retval Нет
				 */
				#define MY_RCC_CRS_DISABLE_AUTOMATIC_CALIB()  		(CRS->CR &= ~CRS_CR_AUTOTRIMEN)


				/**
				 * @brief  Макрос для вычисления значения перезагрузки, устанавливаемого в регистре CRS в соответствии с целевыми и синхронизирующими частотами
				 * @note   Значение перезагрузки следует выбирать в соответствии с соотношением между целевой частотой и частотой источника синхронизации
				 *		   после предварительного масштабирования. Он уменьшается на единицу, чтобы достичь ожидаемой синхронизации при нулевом значении.
				 *		   Формула следующая:
				 *         RELOAD = (fTARGET / fSYNC) -1
				 * @param  _FTARGET_ целевая частота (в Hz)
				 * @param  _FSYNC_ частота сигнала синхронизации (в Hz)
				 * @retval None
				 */
				#define MY_RCC_CRS_CALCULATE_RELOADVALUE(__FTARGET__, __FSYNC__)  	\
																	(((__FTARGET__) / (__FSYNC__)) - 1)

			#endif

		/**
		 * @} MY_RCC_Macros
		 */


		/**
		 * @defgroup MY_RCC_Typedefs
		 * @brief    RCC Typedefs используемые в библиотеке RCC для инициализации тактирования
		 * @{
		 */
			/**
			 * @brief  Структура для настройки и инициализации PLL
			 */
			typedef struct
			{
				uint32_t PLL_State;      			/*!< Состояние PLL */
				uint32_t PLL_Source;     			/*!< Источник тактирования для PLL */
				uint32_t PLL_MUL;        			/*!< Коэфициент умножения для PLL */
				uint32_t PLL_PREDIV;        		/*!< Предделитель для PLL */
			}
			MY_RCC_PLL_Init_t;


			/**
			 * @brief  Структура для хранения конфигурации внутренних/внешних осцилляторов (HSE, HSI, LSE and LSI)
			 */
			typedef struct
			{
				uint32_t OscillatorType;        	/*!< Выбранный осциллятор */
				uint32_t HSE_State;             	/*!< Состояние HSE */
				uint32_t LSE_State;             	/*!< Состояние LSE */
				uint32_t HSI_State;             	/*!< Состояние HSI */
				uint32_t HSI_CalibrationValue;  	/*!< Значение бита калибрации HSI (default is RCC_HSICALIBRATION_DEFAULT).
													 	Значение должно быть в диапазоне Min_Data = 0x00 и Max_Data = 0x1FU */
				uint32_t HSI14_State;          	 	/*!< Состояние HSI14  */
				uint32_t HSI14_CalibrationValue;  	/*!< Значение бита калибрации HSI14 (default is RCC_HSI14CALIBRATION_DEFAULT).
														Значение должно быть в диапазоне Min_Data = 0x00 и Max_Data = 0x1FU */

				uint32_t HSI48_State;              	/*!< Новое состояние HSI48 (применимо только STM32F07x, STM32F0x2 и STM32F09x)
														Значение должно быть @ref RCCEx_HSI48_Config */

				uint32_t LSI_State;              	/*!< Состояние LSI */
				MY_RCC_PLL_Init_t PLL;       		/*!< Параметры PLL */
			}
			MY_RCC_Osc_Init_t;


			/**
			 * @brief  Структура для хранения конфигурации системы тактирования, шин тактирования AHB и APB
			 */
			typedef struct
			{
				uint32_t ClockType;             	/*!< Настройки типа тактирования */
				uint32_t SYSCLK_Source;          	/*!< Источник тактирования для SYSCLK */
				uint32_t AHBCLK_Divider;         	/*!< Делитель шины AHB (HCLK) */
				uint32_t APB1CLK_Divider;       	/*!< Делитель шины APB1 (PCLK1) */
			}
			MY_RCC_Clock_Init_t;


			/**
			 * @brief  Расширенные настройки тактирования для периферии
			 */
			#if defined(STM32F030x6) || \
				defined(STM32F030x8) || \
				defined(STM32F031x6) || \
				defined(STM32F038xx) || \
				defined(STM32F030xC)

				typedef struct
				{
					uint32_t PeriphClockSelection; 	/*!< Конфигурация тактирования для периферии */
					uint32_t RTC_ClockSelection;    /*!< Устанавливает источник тактирования для RTC */
					uint32_t USART1_ClockSelection; /*!< Источник тактирования для USART1 */
					uint32_t I2C1_ClockSelection;   /*!< Источник тактирования для I2C1 */
				}
				MY_RCC_PeriphClock_Init_t;

			#elif defined(STM32F070x6) || \
				defined(STM32F070xB)

				typedef struct
				{
					uint32_t PeriphClockSelection; 	/*!< Конфигурация тактирования для периферии */
					uint32_t RTC_ClockSelection;   	/*!< Устанавливает источник тактирования для RTC */
					uint32_t USART1_ClockSelection; /*!< Источник тактирования для USART1 */
					uint32_t I2C1_ClockSelection;   /*!< Источник тактирования для I2C1 */
					uint32_t USB_ClockSelection;    /*!< Источник тактирования для USB */
				}
				MY_RCC_PeriphClock_Init_t;

			#elif defined(STM32F042x6) || \
				defined(STM32F048xx)

				typedef struct
				{
					uint32_t PeriphClockSelection; 	/*!< Конфигурация тактирования для периферии */
					uint32_t RTC_ClockSelection;    /*!< Устанавливает источник тактирования для RTC */
					uint32_t USART1_ClockSelection; /*!< Источник тактирования для USART1 */
					uint32_t I2C1_ClockSelection;   /*!< Источник тактирования для I2C1 */
					uint32_t CEC_ClockSelection;    /*!< Источник тактирования для HDMI CEC */
					uint32_t USB_ClockSelection;    /*!< Источник тактирования для USB */
				}
				MY_RCC_PeriphClock_Init_t;

