megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_rcc.h
			#elif defined(STM32F051x8) || \
				defined(STM32F058xx)

				typedef struct
				{
					uint32_t PeriphClockSelection; 	/*!< Конфигурация тактирования для периферии */
					uint32_t RTC_ClockSelection;    /*!< Устанавливает источник тактирования для RTC */
					uint32_t USART1_ClockSelection; /*!< Источник тактирования для USART1 */
					uint32_t I2C1_ClockSelection;   /*!< Источник тактирования для I2C1 */
					uint32_t CEC_ClockSelection;    /*!< Источник тактирования для HDMI CEC */
				}
				MY_RCC_PeriphClock_Init_t;

			#elif defined(STM32F071xB)

				typedef struct
				{
					uint32_t PeriphClockSelection; 	/*!< Конфигурация тактирования для периферии */
					uint32_t RTC_ClockSelection;    /*!< Устанавливает источник тактирования для RTC */
					uint32_t USART1_ClockSelection; /*!< Источник тактирования для USART1 */
					uint32_t USART2_ClockSelection; /*!< Источник тактирования для USART2 */
					uint32_t I2C1_ClockSelection;   /*!< Источник тактирования для I2C1 */
					uint32_t CEC_ClockSelection;    /*!< Источник тактирования для HDMI CEC */
				}
				MY_RCC_PeriphClock_Init_t;

			#elif defined(STM32F072xB) || \
				defined(STM32F078xx)

				typedef struct
				{
					uint32_t PeriphClockSelection; 	/*!< Конфигурация тактирования для периферии */
					uint32_t RTC_ClockSelection;    /*!< Устанавливает источник тактирования для RTC */
					uint32_t USART1_ClockSelection; /*!< Источник тактирования для USART1 */
					uint32_t USART2_ClockSelection; /*!< Источник тактирования для USART2 */
					uint32_t I2C1_ClockSelection;   /*!< Источник тактирования для I2C1 */
					uint32_t CEC_ClockSelection;    /*!< Источник тактирования для HDMI CEC */
					uint32_t USB_ClockSelection;    /*!< Источник тактирования для USB */
				}
				MY_RCC_PeriphClock_Init_t;

			#elif defined(STM32F091xC) || \
				defined(STM32F098xx)

				typedef struct
				{
					uint32_t PeriphClockSelection; /*!< Конфигурация тактирования для периферии */
					uint32_t RTC_ClockSelection;    /*!< Устанавливает источник тактирования для RTC */
					uint32_t USART1_ClockSelection; /*!< Источник тактирования для USART1 */
					uint32_t USART2_ClockSelection; /*!< Источник тактирования для USART2 */
					uint32_t USART3_ClockSelection; /*!< Источник тактирования для USART3 */
					uint32_t I2C1_ClockSelection;   /*!< Источник тактирования для I2C1 */
					uint32_t CEC_ClockSelection;    /*!< Источник тактирования для HDMI CEC */
				}
				MY_RCC_PeriphClock_Init_t;

			#endif


			#if defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F071xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx)

				/**
				 * @brief RCC Clock Recovery System (CRS) Init structure definition
				 */
				typedef struct
				{
					uint32_t Prescaler;             /*!< Specifies the division factor of the SYNC signal.
														 This parameter can be a value of @ref RCCEx_CRS_SynchroDivider */
					uint32_t Source;                /*!< Specifies the SYNC signal source.
														 This parameter can be a value of @ref RCCEx_CRS_SynchroSource */
					uint32_t Polarity;              /*!< Specifies the input polarity for the SYNC signal source.
														 This parameter can be a value of @ref RCCEx_CRS_SynchroPolarity */
					uint32_t ReloadValue;           /*!< Specifies the value to be loaded in the frequency error counter with each SYNC event.
														 It can be calculated in using macro MY_RCC_CRS_CALCULATE_RELOADVALUE(_FTARGET_, _FSYNC_)
														 This parameter must be a number between 0 and 0xFFFF or a value of @ref RCCEx_CRS_ReloadValueDefault .*/
					uint32_t ErrorLimitValue;       /*!< Specifies the value to be used to evaluate the captured frequency error value.
														 This parameter must be a number between 0 and 0xFF or a value of @ref RCCEx_CRS_ErrorLimitDefault */
					uint32_t HSI48CalibrationValue; /*!< Specifies a user-programmable trimming value to the HSI48 oscillator.
														 This parameter must be a number between 0 and 0x3F or a value of @ref RCCEx_CRS_HSI48CalibrationDefault */
				}
				MY_RCC_CRS_Init_t;


				/**
				 * @brief RCC_CRS Synchronization structure definition
				 */
				typedef struct
				{
					uint32_t ReloadValue;           /*!< Specifies the value loaded in the Counter reload value.
														 This parameter must be a number between 0 and 0xFFFF */
					uint32_t HSI48CalibrationValue; /*!< Specifies value loaded in HSI48 oscillator smooth trimming.
														 This parameter must be a number between 0 and 0x3F */
					uint32_t FreqErrorCapture;      /*!< Specifies the value loaded in the .FECAP, the frequency error counter value latched in the time of the last SYNC event.
														 This parameter must be a number between 0 and 0xFFFF */
					uint32_t FreqErrorDirection;    /*!< Specifies the value loaded in the .FEDIR, the counting direction of the
														 frequency error counter latched in the time of the last SYNC event.
														 It shows whether the actual frequency is below or above the target.
														 This parameter must be a value of @ref RCCEx_CRS_FreqErrorDirection */
				}
				MY_RCC_CRS_Sync_Info_t;

			#endif /* CRS */

		/**
		 * @} MY_RCC_Typedefs
		 */


		/**
		 * @defgroup MY_RCC_Functions
		 * @brief    RCC функции
		 * @{
		 */
			/**
			 * @brief  Инициализация системного тактирования
			 * @note   Функция @ref MY_RCC_System_Init должна вызываться для иницализации тактирования при старте
			 * 				В ходе выполнения функции:
			 *						- сброс к дефолтным значениям настроек системы тактирования
			 *						- выбор осциллятора в качестве основного
			 *						- если используется PLL - то происходит его настройка
			 *						- настраивается задержка Flash
			 *						- делители HCLK, PCLK1
			 *						- настраивается источник тактирования SYSCLK
			 *						- обновляется значение SystemCoreClock
			 *						- инициализируется SysTick
			 * @param  Нет
			 * @retval MY_RCC_Result_t
			 */
			MY_Result_t MY_RCC_System_Init(void);


			/**
			 * @brief  Сбрасывает настройки RCC к значениям по умолчанию
			 * @note   Значения по умолчанию следующие:
			 *           - HSI ON и используется как источник системного тактирования
			 *           - HSE и PLL OFF
			 *           - AHB, APB1 предделитель устанавливается на 1.
			 *           - CSS и MCO1 OFF
			 *           - Все прерывания выключены
			 * @note   Эта функция не изменяет настройки:
			 *           - Периферии
			 *           - LSI, LSE и RTC
			 * @param  Нет
			 * @retval MY_RCC_Result_t
			 */
			void MY_RCC_System_DeInit(void);


			/**
			 * @brief  Initializes the RCC Oscillators according to the specified parameters in the
			 *         RCC_OscInitTypeDef.
			 * @param  RCC_OscInitStruct pointer to an RCC_OscInitTypeDef structure that
			 *         contains the configuration information for the RCC Oscillators.
			 * @note   The PLL is not disabled when used as system clock.
			 * @note   Transitions LSE Bypass to LSE On and LSE On to LSE Bypass are not
			 *         supported by this macro. User should request a transition to LSE Off
			 *         first and then LSE On or LSE Bypass.
			 * @note   Transition HSE Bypass to HSE On and HSE On to HSE Bypass are not
			 *         supported by this macro. User should request a transition to HSE Off
			 *         first and then HSE On or HSE Bypass.
			 * @retval HAL status
			 */
			MY_Result_t MY_RCC_Osc_Config(MY_RCC_Osc_Init_t *RCC_Osc_InitStruct);


			/**
			 * @brief  Initializes the CPU, AHB and APB buses clocks according to the specified
			 *         parameters in the RCC_ClkInitStruct.
			 * @param  RCC_ClkInitStruct pointer to an RCC_OscInitTypeDef structure that
			 *         contains the configuration information for the RCC peripheral.
			 * @param  FLatency FLASH Latency
			 *          The value of this parameter depend on device used within the same series
			 * @note   The SystemCoreClock CMSIS variable is used to store System Clock Frequency
			 *         and updated by @ref MY_RCC_GetHCLKFreq() function called within this function
			 *
			 * @note   The HSI is used (enabled by hardware) as system clock source after
			 *         start-up from Reset, wake-up from STOP and STANDBY mode, or in case
			 *         of failure of the HSE used directly or indirectly as system clock
			 *         (if the Clock Security System CSS is enabled).
			 *
			 * @note   A switch from one clock source to another occurs only if the target
			 *         clock source is ready (clock stable after start-up delay or PLL locked).
			 *         If a clock source which is not yet ready is selected, the switch will
			 *         occur when the clock source will be ready.
			 *         You can use @ref MY_RCC_GetClockConfig() function to know which clock is
			 *         currently used as system clock source.
			 * @retval HAL status
			 */
			MY_Result_t MY_RCC_Clock_Config(MY_RCC_Clock_Init_t *RCC_Clock_InitStruct, uint32_t FlashLatency);


			/**
			 * @brief  Initializes the RCC extended peripherals clocks according to the specified
			 *         parameters in the RCC_PeriphClock_InitStructTypeDef.
			 * @param  PeriphClock_InitStruct pointer to an RCC_PeriphClock_InitStructTypeDef structure that
			 *         contains the configuration information for the Extended Peripherals clocks
			 *         (USART, RTC, I2C, CEC and USB).
			 *
			 * @note   Care must be taken when @ref HAL_RCCEx_PeriphCLKConfig() is used to select
			 *         the RTC clock source; in this case the Backup domain will be reset in
			 *         order to modify the RTC Clock source, as consequence RTC registers (including
			 *         the backup registers) and RCC_BDCR register are set to their reset values.
			 *
			 * @retval HAL status
			 */
			MY_Result_t MY_RCC_PeriphClock_Config(MY_RCC_PeriphClock_Init_t *RCC_PeriphClock_InitStruct);


			/**
			 * @brief  Get the RCC_ClkInitStruct according to the internal
			 * RCC configuration registers.
			 * @param  PeriphClock_InitStruct pointer to an RCC_PeriphClock_InitStructTypeDef structure that
			 *         returns the configuration information for the Extended Peripherals clocks
			 *         (USART, RTC, I2C, CEC and USB).
			 * @retval None
			 */
			void MY_RCC_PeriphClock_GetConfig(MY_RCC_PeriphClock_Init_t *RCC_PeriphClock_InitStruct);


			/**
			 * @brief  Returns the peripheral clock frequency
			 * @note   Returns 0 if peripheral clock is unknown
			 * @param  PeriphClk Peripheral clock identifier
			 *         This parameter can be one of the following values:
			 *            @arg @ref RCC_PERIPHCLK_RTC     RTC peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_USART1  USART1 peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_I2C1    I2C1 peripheral clock
			 *
			 *			@if STM32F042x6
			 *            @arg @ref RCC_PERIPHCLK_USB     USB peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *			@endif
			 *
			 *			@if STM32F048xx
			 *            @arg @ref RCC_PERIPHCLK_USB     USB peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *          @endif
			 *
			 *          @if STM32F051x8
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *          @endif
			 *
			 *          @if STM32F058xx
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *           @endif
			 *
			 *          @if STM32F070x6
			 *            @arg @ref RCC_PERIPHCLK_USB     USB peripheral clock
			 *          @endif
			 *
			 *          @if STM32F070xB
			 *            @arg @ref RCC_PERIPHCLK_USB     USB peripheral clock
			 *          @endif
			 *
			 *          @if STM32F071xB
			 *            @arg @ref RCC_PERIPHCLK_USART2  USART2 peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *          @endif
			 *
			 *          @if STM32F072xB
			 *            @arg @ref RCC_PERIPHCLK_USART2  USART2 peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_USB     USB peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *          @endif
			 *
			 *        	@if STM32F078xx
			 *            @arg @ref RCC_PERIPHCLK_USART2  USART2 peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_USB     USB peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *          @endif
			 *
			 *          @if STM32F091xC
			 *            @arg @ref RCC_PERIPHCLK_USART2  USART2 peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_USART3  USART2 peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *          @endif
			 *
			 *          @if STM32F098xx
			 *            @arg @ref RCC_PERIPHCLK_USART2  USART2 peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_USART3  USART2 peripheral clock
			 *            @arg @ref RCC_PERIPHCLK_CEC     CEC peripheral clock
			 *          @endif
			 *
			 * @retval Frequency in Hz (0: means that no available frequency for the peripheral)
			 */
			uint32_t MY_RCC_PeriphClock_GetFreq(uint32_t PeriphClock);


			/**
			 * @brief  Returns the SYSCLK frequency
			 * @note   The system frequency computed by this function is not the real
			 *         frequency in the chip. It is calculated based on the predefined
			 *         constant and the selected clock source:
			 * @note     If SYSCLK source is HSI, function returns values based on HSI_VALUE(*)
			 * @note     If SYSCLK source is HSE, function returns a value based on HSE_VALUE
			 *           divided by PREDIV factor(**)
			 * @note     If SYSCLK source is PLL, function returns a value based on HSE_VALUE
			 *           divided by PREDIV factor(**) or depending on STM32F0xxxx devices either a value based
			 *           on HSI_VALUE divided by 2 or HSI_VALUE divided by PREDIV factor(*) multiplied by the
			 *           PLL factor.
			 * @note     (*) HSI_VALUE is a constant defined in stm32f0xx_hal_conf.h file (default value
			 *               8 MHz) but the real value may vary depending on the variations
			 *               in voltage and temperature.
			 * @note     (**) HSE_VALUE is a constant defined in stm32f0xx_hal_conf.h file (default value
			 *                8 MHz), user has to ensure that HSE_VALUE is same as the real
			 *                frequency of the crystal used. Otherwise, this function may
			 *                have wrong result.
			 *
			 * @note   The result of this function could be not correct when using fractional
			 *         value for HSE crystal.
			 *
			 * @note   This function can be used by the user application to compute the
			 *         baud-rate for the communication peripherals or configure other parameters.
			 *
			 * @note   Each time SYSCLK changes, this function must be called to update the
			 *         right SYSCLK value. Otherwise, any configuration based on this function will be incorrect.
			 *
			 * @retval SYSCLK frequency
			 */
			uint32_t MY_RCC_SysClock_GetFreq(void);


			/**
			 * @brief  Возвращает текущую частоту HCLK
			 * @note   Each time HCLK changes, this function must be called to update the
			 *         right HCLK value. Otherwise, any configuration based on this function will be incorrect.
			 *
			 * @note   The SystemCoreClock CMSIS variable is used to store System Clock Frequency
			 *         and updated within this function
			 * @retval HCLK frequency
			 */
			uint32_t MY_RCC_HCLK_GetFreq(void);


			/**
			 * @brief  Возвращает текущую частоту PCLK1
			 * @note   Each time PCLK1 changes, this function must be called to update the right PCLK1 value.
			 * 		   Otherwise, any configuration based on this function will be incorrect.
			 * @retval PCLK1 frequency
			 */
			uint32_t MY_RCC_PCLK1_GetFreq(void);


			/**
			 * @brief  Configures the RCC_OscInitStruct according to the internal RCC configuration registers.
			 * @param  RCC_OscInitStruct pointer to an RCC_OscInitTypeDef structure that will be configured.
			 * @retval None
			 */
			void MY_RCC_Osc_GetConfig(MY_RCC_Osc_Init_t *RCC_Osc_InitStruct);


			/**
			 * @brief  Get the RCC_ClkInitStruct according to the internal RCC configuration registers.
			 * @param  RCC_ClkInitStruct pointer to an RCC_ClkInitTypeDef structure that contains the current clock configuration.
			 * @param  pFLatency Pointer on the Flash Latency.
			 * @retval None
			 */
			void MY_RCC_Clock_GetConfig(MY_RCC_Clock_Init_t *RCC_Clk_InitStruct, uint32_t *pFLatency);


			/**
			 * @brief  Selects the clock source to output on MCO pin.
			 * @note   MCO pin should be configured in alternate function mode.
			 * @param  RCC_MCO_Source specifies the clock source to output.
			 *          This parameter can be one of the following values:
			 *            @arg @ref RCC_MCO1SOURCE_NOCLOCK     No clock selected as MCO clock
			 *            @arg @ref RCC_MCO1SOURCE_SYSCLK      System clock selected as MCO clock
			 *            @arg @ref RCC_MCO1SOURCE_HSI         HSI selected as MCO clock
			 *            @arg @ref RCC_MCO1SOURCE_HSE         HSE selected as MCO clock
			 *            @arg @ref RCC_MCO1SOURCE_LSI         LSI selected as MCO clock
			 *            @arg @ref RCC_MCO1SOURCE_LSE         LSE selected as MCO clock
			 *            @arg @ref RCC_MCO1SOURCE_HSI14       HSI14 selected as MCO clock
			 *            @arg @ref RCC_MCO1SOURCE_PLLCLK_DIV2 PLLCLK Divided by 2 selected as MCO clock
			 * @param  RCC_MCO_Div specifies the MCO DIV.
			 *          This parameter can be one of the following values:
			 *            @arg @ref RCC_MCODIV_1 no division applied to MCO clock
			 * @retval None
			 */
			void MY_RCC_MCO_Config(uint32_t RCC_MCO_Source, uint32_t RCC_MCO_Div);


			/**
			 * @brief  Enables the Clock Security System.
			 * @note   If a failure is detected on the HSE oscillator clock, this oscillator
			 *         is automatically disabled and an interrupt is generated to inform the
			 *         software about the failure (Clock Security System Interrupt, CSSI),
			 *         allowing the MCU to perform rescue operations. The CSSI is linked to
			 *         the Cortex-M0 NMI (Non-Maskable Interrupt) exception vector.
			 * @retval None
			 */
			void MY_RCC_CSS_Enable(void);


			/**
			 * @brief  Disables the Clock Security System.
			 * @retval None
			 */
			void MY_RCC_CSS_Disable(void);


			#if defined(STM32F042x6) || \
				defined(STM32F048xx) || \
				defined(STM32F071xB) || \
				defined(STM32F072xB) || \
				defined(STM32F078xx) || \
				defined(STM32F091xC) || \
				defined(STM32F098xx)

				/**
				 * @brief  Start automatic synchronization for polling mode
				 * @param  pInit Pointer on RCC_CRSInitTypeDef structure
				 * @retval None
				 */
				void MY_RCC_CRS_Config(MY_RCC_CRS_Init_t *pInit);


				/**
				 * @brief  Generate the software synchronization event
				 * @retval None
				 */
				void MY_RCC_CRS_SoftwareSyncGenerate(void);


				/**
				 * @brief  Return synchronization info
				 * @param  pSynchroInfo Pointer on RCC_CRSSynchroInfoTypeDef structure
				 * @retval None
				 */
				void MY_RCC_CRS_GetSyncInfo(RCC_CRSSyncInfo_t *pSyncInfo);


				/**
				 * @brief Wait for CRS Synchronization status.
				 * @param Timeout  Duration of the timeout
				 * @note  Timeout is based on the maximum time to receive a SYNC event based on synchronization frequency.
				 * @note  If Timeout set to HAL_MAX_DELAY, HAL_TIMEOUT will be never returned.
				 * @retval Combination of Synchronization status
				 *          This parameter can be a combination of the following values:
				 *            @arg @ref RCC_CRS_TIMEOUT
				 *            @arg @ref RCC_CRS_SYNCOK
				 *            @arg @ref RCC_CRS_SYNCWARN
				 *            @arg @ref RCC_CRS_SYNCERR
				 *            @arg @ref RCC_CRS_SYNCMISS
				 *            @arg @ref RCC_CRS_TRIMOVF
				 */
				uint32_t MY_RCC_CRS_WaitSync(uint32_t Timeout);


				/**
				 * @brief Handle the Clock Recovery System interrupt request.
				 * @retval None
				 */
				void MY_RCC_CRS_IRQHandler(void);


				/**
				 * @brief  RCC Clock Recovery System SYNCOK interrupt callback.
				 * @retval none
				 */
				void MY_RCC_CRS_SyncOkCallback(void);


				/**
				 * @brief  RCC Clock Recovery System SYNCWARN interrupt callback.
				 * @retval none
				 */
				void MY_RCC_CRS_SyncWarnCallback(void);


				/**
				 * @brief  RCCEx Clock Recovery System Expected SYNC interrupt callback.
				 * @retval none
				 */
				void MY_RCC_CRS_ExpectedSyncCallback(void);


				/**
				 * @brief  RCCEx Clock Recovery System Error interrupt callback.
				 * @param  Error Combination of Error status.
				 *         This parameter can be a combination of the following values:
				 *           @arg @ref RCC_CRS_SYNCERR
				 *           @arg @ref RCC_CRS_SYNCMISS
				 *           @arg @ref RCC_CRS_TRIMOVF
				 * @retval none
				 */
				void MY_RCC_CRS_ErrorCallback(uint32_t Error);

			#endif

			/**
			 * @} MY_RCC_Functions
			 */

		/**
		 * @}
		 */

	/**
	 * @}
	 */

	/* C++ detection */
	#ifdef __cplusplus
		}
	#endif

#endif
